TopicResearch/Mycobacterium/_Resources.org
#+TITLE: Other Papers
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+HTML_HEAD: <style> p{margin-bottom:5px;}</style>
#+HTML_HEAD: <style> li{margin-bottom:10px}</style

