TopicResearch/Mycobacterium/_Resources.org
* TODO Hybrid design of isonicotinic acid hydrazide derivatives: machine learning studies, synthesis and biological evaluation of their anti-tuberculosis activity.
https://www.ncbi.nlm.nih.gov/pubmed/30973110
* TODO Machine learning and tubercular drug target recognition.
https://www.ncbi.nlm.nih.gov/pubmed/24245763





* WAIT Ahmed2020 - Non-tuberculous mycobacterial infections—A neglected and emerging problem
** Notes
- Survey paper
- Could be used build up the background for the need for research in NTM
** FileName
- Ahmed2020_NonTuberculosisMycoANeglectedAndEmergingProblem.pdf
** Abstract
- The incidence of NTM infections is rising owing to a growing population of
  immunocompromised and vulnerable individuals, complex medical and surgical
  procedures, as well as increased awareness and diagnostic capabilities.
** FutureWork
- Simpler and more rapid tests would be ideal in making the diagnosis of NTM
  disease more quickly. However, the development of such tests is complicated
  by the large number of NTM species that can cause disease and by the criteria
  for disease, which require more than just the presence of the microorganism.
  As a result, NTM disease will require multiple diagnostic parameters, leading
  to delays and higher costs. More specific biomarkers to monitor the progress
  of treatment and test cure are lacking.
 
* [ ] Aze2015 - Genomics and Machine Learning for Taxonomy Consensus: The Mycobacterium tuberculosis Complex Paradigm
** Notes
- Can adopt a similar approach towards the classification of NTM lineages
  EMILYN: Taxonomy does not make sense for NTM. Even a DB doesn't exist
  specifically for Resistance and Prediction but the raw genomes are available
  in NCBI
 
- Can alter the algorithm to XGBoost or Neural Networks to improve accuracy
  EMILYN: This has been done already
** FileName
- Aze2015_GenomicsAndMachine.pdf
** Abstract
- Mycobacterium tuberculosis complex taxonomy has rapidly evolved in the last 20
  years through intensive clinical isolation, advances in sequencing and in the
  description of fast-evolving loci (CRISPR and MIRU-VNTR)

  EMILYN: This paper has been a bit outdated now since someone reclassified these
  again and found MTB is a complex and combines ( Tuberculosis, Africanum and
  Bovis )
 
- The objectives of this study were 1) to explicit the consensus that exists
  between the alternative taxonomies, and 2) to provide an on-line tool to ease
  classification of new isolates. Genotyping (24-VNTR, 43-spacers spoli-
  gotypes, IS6110-RFLP) was undertaken for 3,454 clinical isolates from the
  Netherlands (2004-2008). The resulting database was enlarged with African
  isolates to include most human tuberculosis diversity. Assignations were
  obtained using TB-Lineage, MIRU-VNTRPlus, SITVITWEB and an algorithm from
  Borile et al
 
- Original and consensus assignations of the all isolates from the database were
  subsequently implemented into an ensemble learning approach based on Machine
  Learning tool Weka to derive a classification scheme.
 
- When applied to independent datasets, it was able to suggest new sublineages
  such as pseudo-Beijing. This Lineage Prediction tool, efficient on 15-MIRU,
  24-VNTR and spoligotype data is available on the web interface “TBminer.”

  EMILYN: No one really uses this TBMiner actually due to the interface not
  being good and is inconsistent. Maybe we can work on this later to improve the
  online service.
 
- We successfully used Machine Learning on a large dataset to set up and make
  available the first consensual taxonomy for human Mycobacterium tuberculosis
  complex
 
** Conclusion
- We developed an approach making use of standard typing data for human M.
tuberculosis isolates to infer a consensual taxonomy concordant with most
up-to-date data on Whole Genome Sequencing diversity.

- We hope that the same approach can benefit other human pathogens having
  alternative taxonomies according to Serotypes, CRISPRtypes, MLST-types such as
  Salmo- nella, Listeria, Brucella, and more broadly to other organisms such as
  bacterial plant- pathogens.
 
* [-] Bagherian2019 - Machine learning approaches and databases for prediction of drug–target interaction: a survey paper
** Notes
- Not directly related to (N)TB
- Survey paper
- Analyzes various ML techniques
- Mentions various drug-target-interaction databases
** FileName
- Bagherian2019_MachineLearning.pdf
** Abstract
- There is a need to develop novel and efficient prediction approaches in order
  to avoid costly and laborious yet not-always-deterministic experiments to
  determine drug–target interactions (DTIs) by experiments alone
- In this article, we describe the data required for the task of DTI prediction
  followed by a comprehensive catalog consisting of machine learning methods and
  databases, which have been proposed and utilized to predict DTIs
- The advantages and disadvantages of each set of methods are also briefly
  discussed
** Conclusion
- Almost all the methods used in DTI prediction, particularly similarity-based
  methods, heavily rely on assertions concerning similar drugs and similar
  targets, the type of database used for the prediction plays a significant
  role.
- Future predictions should rely on more comprehensive inter- nal databases,
  which would require a significant effort to map and curate data across the
  sources that utilize different ways to define, name and identify the drugs and
  targets.

* [X] Cao2016 - Improving Tuberculosis Diagnostics Using Deep Learning and Mobile Health Technologies among Resource-Poor and Marginalized Communities
** Notes
- Image processing algorithms, CNN
- They proposed an online database of X-ray images - by now this might have been developed
