TopicResearch/Mycobacterium/_Resources.html
<div id="outline-container-org23b41c5" class="outline-2">
<h2 id="org23b41c5"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> Hybrid design of isonicotinic acid hydrazide derivatives: machine learning studies, synthesis and biological evaluation of their anti-tuberculosis activity.</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://www.ncbi.nlm.nih.gov/pubmed/30973110">https://www.ncbi.nlm.nih.gov/pubmed/30973110</a>
</p>
</div>
</div>
<div id="outline-container-org988d028" class="outline-2">
<h2 id="org988d028"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> Machine learning and tubercular drug target recognition.</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://www.ncbi.nlm.nih.gov/pubmed/24245763">https://www.ncbi.nlm.nih.gov/pubmed/24245763</a>
</p>
</div>
</div>





<div id="outline-container-orgcbaad56" class="outline-2">
<h2 id="orgcbaad56"><span class="section-number-2">4</span> <span class="todo WAIT">WAIT</span> Ahmed2020 - Non-tuberculous mycobacterial infections—A neglected and emerging problem</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org58ecfe1" class="outline-3">
<h3 id="org58ecfe1"><span class="section-number-3">4.1</span> Notes</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Survey paper</li>
<li>Could be used build up the background for the need for research in NTM</li>
</ul>
</div>
</div>
<div id="outline-container-orgff3322c" class="outline-3">
<h3 id="orgff3322c"><span class="section-number-3">4.2</span> FileName</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Ahmed2020<sub>NonTuberculosisMycoANeglectedAndEmergingProblem.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org91e2aee" class="outline-3">
<h3 id="org91e2aee"><span class="section-number-3">4.3</span> Abstract</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>The incidence of NTM infections is rising owing to a growing population of
immunocompromised and vulnerable individuals, complex medical and surgical
procedures, as well as increased awareness and diagnostic capabilities.</li>
</ul>
</div>
</div>
<div id="outline-container-org62fa5ca" class="outline-3">
<h3 id="org62fa5ca"><span class="section-number-3">4.4</span> FutureWork</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>Simpler and more rapid tests would be ideal in making the diagnosis of NTM
disease more quickly. However, the development of such tests is complicated
by the large number of NTM species that can cause disease and by the criteria
for disease, which require more than just the presence of the microorganism.
As a result, NTM disease will require multiple diagnostic parameters, leading
to delays and higher costs. More specific biomarkers to monitor the progress
of treatment and test cure are lacking.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7e83980" class="outline-2">
<h2 id="org7e83980"><span class="section-number-2">5</span> <span class="todo ___">[ ]</span> Aze2015 - Genomics and Machine Learning for Taxonomy Consensus: The Mycobacterium tuberculosis Complex Paradigm</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org1be269f" class="outline-3">
<h3 id="org1be269f"><span class="section-number-3">5.1</span> Notes</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Can adopt a similar approach towards the classification of NTM lineages
EMILYN: Taxonomy does not make sense for NTM. Even a DB doesn&rsquo;t exist
specifically for Resistance and Prediction but the raw genomes are available
in NCBI</li>

<li>Can alter the algorithm to XGBoost or Neural Networks to improve accuracy
EMILYN: This has been done already</li>
</ul>
</div>
</div>
<div id="outline-container-org7b3a768" class="outline-3">
<h3 id="org7b3a768"><span class="section-number-3">5.2</span> FileName</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Aze2015<sub>GenomicsAndMachine.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org1786337" class="outline-3">
<h3 id="org1786337"><span class="section-number-3">5.3</span> Abstract</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li><p>
Mycobacterium tuberculosis complex taxonomy has rapidly evolved in the last 20
years through intensive clinical isolation, advances in sequencing and in the
description of fast-evolving loci (CRISPR and MIRU-VNTR)
</p>

<p>
EMILYN: This paper has been a bit outdated now since someone reclassified these
again and found MTB is a complex and combines ( Tuberculosis, Africanum and
Bovis )
</p></li>

<li>The objectives of this study were 1) to explicit the consensus that exists
between the alternative taxonomies, and 2) to provide an on-line tool to ease
classification of new isolates. Genotyping (24-VNTR, 43-spacers spoli-
gotypes, IS6110-RFLP) was undertaken for 3,454 clinical isolates from the
Netherlands (2004-2008). The resulting database was enlarged with African
isolates to include most human tuberculosis diversity. Assignations were
obtained using TB-Lineage, MIRU-VNTRPlus, SITVITWEB and an algorithm from
Borile et al</li>

<li>Original and consensus assignations of the all isolates from the database were
subsequently implemented into an ensemble learning approach based on Machine
Learning tool Weka to derive a classification scheme.</li>

<li><p>
When applied to independent datasets, it was able to suggest new sublineages
such as pseudo-Beijing. This Lineage Prediction tool, efficient on 15-MIRU,
24-VNTR and spoligotype data is available on the web interface “TBminer.”
</p>

<p>
EMILYN: No one really uses this TBMiner actually due to the interface not
being good and is inconsistent. Maybe we can work on this later to improve the
online service.
</p></li>

<li>We successfully used Machine Learning on a large dataset to set up and make
available the first consensual taxonomy for human Mycobacterium tuberculosis
complex</li>
</ul>
</div>
</div>

<div id="outline-container-org5ad2bd5" class="outline-3">
<h3 id="org5ad2bd5"><span class="section-number-3">5.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>We developed an approach making use of standard typing data for human M.</li>
</ul>
<p>
tuberculosis isolates to infer a consensual taxonomy concordant with most
up-to-date data on Whole Genome Sequencing diversity.
</p>

<ul class="org-ul">
<li>We hope that the same approach can benefit other human pathogens having
alternative taxonomies according to Serotypes, CRISPRtypes, MLST-types such as
Salmo- nella, Listeria, Brucella, and more broadly to other organisms such as
bacterial plant- pathogens.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgdd31c86" class="outline-2">
<h2 id="orgdd31c86"><span class="section-number-2">6</span> <span class="todo ___">[-]</span> Bagherian2019 - Machine learning approaches and databases for prediction of drug–target interaction: a survey paper</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgada71d5" class="outline-3">
<h3 id="orgada71d5"><span class="section-number-3">6.1</span> Notes</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Not directly related to (N)TB</li>
<li>Survey paper</li>
<li>Analyzes various ML techniques</li>
<li>Mentions various drug-target-interaction databases</li>
</ul>
</div>
</div>
<div id="outline-container-orgeb9a2ba" class="outline-3">
<h3 id="orgeb9a2ba"><span class="section-number-3">6.2</span> FileName</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>Bagherian2019<sub>MachineLearning.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org8877e70" class="outline-3">
<h3 id="org8877e70"><span class="section-number-3">6.3</span> Abstract</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>There is a need to develop novel and efficient prediction approaches in order
to avoid costly and laborious yet not-always-deterministic experiments to
determine drug–target interactions (DTIs) by experiments alone</li>
<li>In this article, we describe the data required for the task of DTI prediction
followed by a comprehensive catalog consisting of machine learning methods and
databases, which have been proposed and utilized to predict DTIs</li>
<li>The advantages and disadvantages of each set of methods are also briefly
discussed</li>
</ul>
</div>
</div>
<div id="outline-container-org85aa865" class="outline-3">
<h3 id="org85aa865"><span class="section-number-3">6.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-6-4">
<ul class="org-ul">
<li>Almost all the methods used in DTI prediction, particularly similarity-based
methods, heavily rely on assertions concerning similar drugs and similar
targets, the type of database used for the prediction plays a significant
role.</li>
<li>Future predictions should rely on more comprehensive inter- nal databases,
which would require a significant effort to map and curate data across the
sources that utilize different ways to define, name and identify the drugs and
targets.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbdebada" class="outline-2">
<h2 id="orgbdebada"><span class="section-number-2">7</span> <span class="done _X_">[X]</span> Cao2016 - Improving Tuberculosis Diagnostics Using Deep Learning and Mobile Health Technologies among Resource-Poor and Marginalized Communities</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org92291d3" class="outline-3">
<h3 id="org92291d3"><span class="section-number-3">7.1</span> Notes</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>Image processing algorithms, CNN</li>
<li>They proposed an online database of X-ray images - by now this might have been developed</li>
</ul>
</div>
</div>
