TopicResearch/Mycobacterium/_Resources.org
** FileName
- Cao2016_ImprovingDiagnosticsUsingDL.pdf
** Abstract
- The combination of machine learning and mobile computing techniques offers a
  unique opportunity to accelerate the TB diagnosis among these communities

- We first introduce major technique barriers and proposed system architecture

- The first activity aims to develop large-scale, real-world and well-annotated
  X-ray image database dedicated for automated TB screening.

- The second research activity focus on developing effective and efficient
  computational models (in particularly, deep convolutional neural networks
  (CNN)-based models) to classify the image into different category of TB
  manifestations
 
- Our future work includes: (1) to further improve the performance of the
  algorithms; and (2) to deploy our system in the city of Carabayllo in Perú, a
  densely occupied urban community and high-burden TB
 
** Conclusion
- The first progress is to build a large-scale, real-world, and well-annotated chest X- ray image
  database dedicated for TB screening.
 
- The second progress is to develop effective and efficient computational model for TB manifestation
  categorization.

- We will continue to develop the large scale, real-world X-ray TB database, as
  well as continuing to improve the performance of the computing algorithms

* DONE Chen2018 - Deep Learning Predicts Tuberculosis Drug Resistance Status from Whole-Genome Sequencing Data
EMILYN: Please confirm if similar initial data could be found for NTM then we
can work on NTM projects. Otherwise we can work on same data with different algorithm
** Notes
- A good in-depth ML based paper
- They've shared high-level implementation details briefly
- Hyperparameters are also in the supplementary material
- I was able to find the code on Github
  https://github.com/biosharp-dotnet/wdnn
- Could apply the same techniques to NTM
- Could change the algorithm and apply on the same data
- Could compare multiple algorithms in context of NTM
  EMILYN: We could make these three projects from this paper itself.
- The author built upon the previous paper by improving the accuracy of the ML
  model - we could do the same with NTM
 
** FileName
- Chen2018_DeepLearningPredictsTuberculosis.pdf
** Abstract
- Using targeted or whole genome sequencing and conventional drug resistance
  phenotyping data from 3,601 Mycobacterium tuberculosis strains, 1,228 of which
  were multidrug resistant, we implemented the first multitask deep learning
  framework to predict phenotypic drug resistance to 10 anti-tubercular drugs
 
- The proposed wide and deep neural network (WDNN) achieved improved predictive
  performance compared to regularized logistic regression and random forest

  EMILYN: We can package this tool for bioconda useful
** Conclusion

- We demonstrate that L2 regression and MD-WDNN trained on a larger diverse
  dataset using a method of aggregating rare variants outperforms our previously
  reported random forest model. (Chen, 2018)

- A few prior studies have utilized algorithmic or machine learning methods
  using genomic data to account for the complex relationship between genotype
  and drug resistance in MTB
 
* DONE Chen2019 - Beyond multidrug resistance: Leveraging rare variants with machine and statistical learning models in Mycobacterium tuberculosis resistance prediction
EMILYN: Check if similar data exists for NTM or if we can download the same data.
** Notes
- A good in-depth ML based paper
- Could apply the same techniques to NTM
- Could change the algorithm and apply on the same data
- This paper builds upon the work done by same author Chen2018
- I was able to find the code on Github
  https://github.com/biosharp-dotnet/wdnn
** FileName
- Chen2019_BeyondMultiDrugResistance.pdf
** Abstract
- Whole genome sequencing of clinical Mycobacterium tuberculosis isolates
  promises to circumvent the long wait times and limited scope of conventional
  phenotypic antimicrobial susceptibility, but gaps remain for predicting
  phenotype accurately from genotypic data especially for certain drugs.
 
- We collected targeted or whole genome sequencing and conventional drug
  resistance phenotyping data from 3601 Mycobacterium tuberculosis strains
  enriched for resistance to first- and second-line drugs, with 1228 multidrug
  resistant strains

- We investigated the utility of (1) rare variants and variants known to be
  determinants of resistance for at least one drug and (2) machine and
  statistical learning architectures in predicting phenotypic drug resistance to
  10 anti-tuberculosis drugs

** Conclusion
- Our approach allowed us to gain new insights into the relative im- portance of
  specific genetic variants for resistance prediction
 
- In summary, we present an exploration of machine learning and traditional
  statistical models to identify the resistance of MTB isolates to 10
  anti-tuberculosis drugs from whole genome sequencing data.
 
- Our models trained on rare and common genetic variants achieved
  state-of-the-art performance on a large, aggregated TB dataset, with
  prediction times of less than a tenth of a second, demonstrating the efficacy
  of our model as a diagnostic tool for MTB drug resistance.

- The MD-WDNN represented the first multidrug model to our knowledge that
  incorporated a high number of genotypic predictors known to be important to
  determining resistance for one or more included drugs

** Supplementary
- Chen2019_BeyondMultiDrugResistance_Supplement_4.xlsx
- Chen2019_BeyondMultiDrugResistance_Supplement_3.xlsx
- Chen2019_BeyondMultiDrugResistance_Supplement_2.xlsx
- Chen2019_BeyondMultiDrugResistance_Supplement_1.docx
* [-] Ching2018 - Opportunities and obstacles for deep learning in biology and medicine
** Notes
- Found the code https://github.com/greenelab/deep-review
- Can use this paper to build up the background for using DL in MTB and NTM analysis
