TopicResearch/Mycobacterium/_Resources.html
<div id="outline-container-org0c14674" class="outline-3">
<h3 id="org0c14674"><span class="section-number-3">7.2</span> FileName</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>Cao2016<sub>ImprovingDiagnosticsUsingDL.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org4c1eb0a" class="outline-3">
<h3 id="org4c1eb0a"><span class="section-number-3">7.3</span> Abstract</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>The combination of machine learning and mobile computing techniques offers a
unique opportunity to accelerate the TB diagnosis among these communities</li>

<li>We first introduce major technique barriers and proposed system architecture</li>

<li>The first activity aims to develop large-scale, real-world and well-annotated
X-ray image database dedicated for automated TB screening.</li>

<li>The second research activity focus on developing effective and efficient
computational models (in particularly, deep convolutional neural networks
(CNN)-based models) to classify the image into different category of TB
manifestations</li>

<li>Our future work includes: (1) to further improve the performance of the
algorithms; and (2) to deploy our system in the city of Carabayllo in Perú, a
densely occupied urban community and high-burden TB</li>
</ul>
</div>
</div>

<div id="outline-container-org89610da" class="outline-3">
<h3 id="org89610da"><span class="section-number-3">7.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-7-4">
<ul class="org-ul">
<li>The first progress is to build a large-scale, real-world, and well-annotated chest X- ray image
database dedicated for TB screening.</li>

<li>The second progress is to develop effective and efficient computational model for TB manifestation
categorization.</li>

<li>We will continue to develop the large scale, real-world X-ray TB database, as
well as continuing to improve the performance of the computing algorithms</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbb028f6" class="outline-2">
<h2 id="orgbb028f6"><span class="section-number-2">8</span> <span class="done DONE">DONE</span> Chen2018 - Deep Learning Predicts Tuberculosis Drug Resistance Status from Whole-Genome Sequencing Data</h2>
<div class="outline-text-2" id="text-8">
<p>
EMILYN: Please confirm if similar initial data could be found for NTM then we
can work on NTM projects. Otherwise we can work on same data with different algorithm
</p>
</div>
<div id="outline-container-orgf9ac363" class="outline-3">
<h3 id="orgf9ac363"><span class="section-number-3">8.1</span> Notes</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>A good in-depth ML based paper</li>
<li>They&rsquo;ve shared high-level implementation details briefly</li>
<li>Hyperparameters are also in the supplementary material</li>
<li>I was able to find the code on Github
<a href="https://github.com/biosharp-dotnet/wdnn">https://github.com/biosharp-dotnet/wdnn</a></li>
<li>Could apply the same techniques to NTM</li>
<li>Could change the algorithm and apply on the same data</li>
<li>Could compare multiple algorithms in context of NTM
EMILYN: We could make these three projects from this paper itself.</li>
<li>The author built upon the previous paper by improving the accuracy of the ML
model - we could do the same with NTM</li>
</ul>
</div>
</div>

<div id="outline-container-org23c093c" class="outline-3">
<h3 id="org23c093c"><span class="section-number-3">8.2</span> FileName</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>Chen2018<sub>DeepLearningPredictsTuberculosis.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org832f007" class="outline-3">
<h3 id="org832f007"><span class="section-number-3">8.3</span> Abstract</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>Using targeted or whole genome sequencing and conventional drug resistance
phenotyping data from 3,601 Mycobacterium tuberculosis strains, 1,228 of which
were multidrug resistant, we implemented the first multitask deep learning
framework to predict phenotypic drug resistance to 10 anti-tubercular drugs</li>

<li><p>
The proposed wide and deep neural network (WDNN) achieved improved predictive
performance compared to regularized logistic regression and random forest
</p>

<p>
EMILYN: We can package this tool for bioconda useful
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org3c2a443" class="outline-3">
<h3 id="org3c2a443"><span class="section-number-3">8.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-8-4">
<ul class="org-ul">
<li>We demonstrate that L2 regression and MD-WDNN trained on a larger diverse
dataset using a method of aggregating rare variants outperforms our previously
reported random forest model. (Chen, 2018)</li>

<li>A few prior studies have utilized algorithmic or machine learning methods
using genomic data to account for the complex relationship between genotype
and drug resistance in MTB</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org52f1ec4" class="outline-2">
<h2 id="org52f1ec4"><span class="section-number-2">9</span> <span class="done DONE">DONE</span> Chen2019 - Beyond multidrug resistance: Leveraging rare variants with machine and statistical learning models in Mycobacterium tuberculosis resistance prediction</h2>
<div class="outline-text-2" id="text-9">
<p>
EMILYN: Check if similar data exists for NTM or if we can download the same data.
</p>
</div>
<div id="outline-container-orgb517e0b" class="outline-3">
<h3 id="orgb517e0b"><span class="section-number-3">9.1</span> Notes</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>A good in-depth ML based paper</li>
<li>Could apply the same techniques to NTM</li>
<li>Could change the algorithm and apply on the same data</li>
<li>This paper builds upon the work done by same author Chen2018</li>
<li>I was able to find the code on Github
<a href="https://github.com/biosharp-dotnet/wdnn">https://github.com/biosharp-dotnet/wdnn</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7788556" class="outline-3">
<h3 id="org7788556"><span class="section-number-3">9.2</span> FileName</h3>
<div class="outline-text-3" id="text-9-2">
<ul class="org-ul">
<li>Chen2019<sub>BeyondMultiDrugResistance.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-orgce98bae" class="outline-3">
<h3 id="orgce98bae"><span class="section-number-3">9.3</span> Abstract</h3>
<div class="outline-text-3" id="text-9-3">
<ul class="org-ul">
<li>Whole genome sequencing of clinical Mycobacterium tuberculosis isolates
promises to circumvent the long wait times and limited scope of conventional
phenotypic antimicrobial susceptibility, but gaps remain for predicting
phenotype accurately from genotypic data especially for certain drugs.</li>

<li>We collected targeted or whole genome sequencing and conventional drug
resistance phenotyping data from 3601 Mycobacterium tuberculosis strains
enriched for resistance to first- and second-line drugs, with 1228 multidrug
resistant strains</li>

<li>We investigated the utility of (1) rare variants and variants known to be
determinants of resistance for at least one drug and (2) machine and
statistical learning architectures in predicting phenotypic drug resistance to
10 anti-tuberculosis drugs</li>
</ul>
</div>
</div>

<div id="outline-container-org35fc982" class="outline-3">
<h3 id="org35fc982"><span class="section-number-3">9.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-9-4">
<ul class="org-ul">
<li>Our approach allowed us to gain new insights into the relative im- portance of
specific genetic variants for resistance prediction</li>

<li>In summary, we present an exploration of machine learning and traditional
statistical models to identify the resistance of MTB isolates to 10
anti-tuberculosis drugs from whole genome sequencing data.</li>

<li>Our models trained on rare and common genetic variants achieved
state-of-the-art performance on a large, aggregated TB dataset, with
prediction times of less than a tenth of a second, demonstrating the efficacy
of our model as a diagnostic tool for MTB drug resistance.</li>

<li>The MD-WDNN represented the first multidrug model to our knowledge that
incorporated a high number of genotypic predictors known to be important to
determining resistance for one or more included drugs</li>
</ul>
</div>
</div>

<div id="outline-container-org28c1651" class="outline-3">
<h3 id="org28c1651"><span class="section-number-3">9.5</span> Supplementary</h3>
<div class="outline-text-3" id="text-9-5">
<ul class="org-ul">
<li>Chen2019<sub>BeyondMultiDrugResistance</sub><sub>Supplement</sub><sub>4.xlsx</sub></li>
<li>Chen2019<sub>BeyondMultiDrugResistance</sub><sub>Supplement</sub><sub>3.xlsx</sub></li>
<li>Chen2019<sub>BeyondMultiDrugResistance</sub><sub>Supplement</sub><sub>2.xlsx</sub></li>
<li>Chen2019<sub>BeyondMultiDrugResistance</sub><sub>Supplement</sub><sub>1.docx</sub></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd1db7f7" class="outline-2">
<h2 id="orgd1db7f7"><span class="section-number-2">10</span> <span class="todo ___">[-]</span> Ching2018 - Opportunities and obstacles for deep learning in biology and medicine</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org27736b4" class="outline-3">
<h3 id="org27736b4"><span class="section-number-3">10.1</span> Notes</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li>Found the code <a href="https://github.com/greenelab/deep-review">https://github.com/greenelab/deep-review</a></li>
<li>Can use this paper to build up the background for using DL in MTB and NTM analysis</li>
</ul>
</div>
</div>
