TopicResearch/Mycobacterium/_Resources.org
** FileName
- Ching2018_OpportunitiesAndObstaclesForDLInBiology.pdf
** Abstract
- Following from an extensive literature review, we find that deep learning has
  yet to revolutionize biomedicine or definitively resolve any of the most
  pressing challenges in the field, but promising advances have been made on the
  prior state of the art
- The limited amount of labelled data for training presents problems in some
  domains, as do legal and privacy constraints on work with sensitive health
  records.

** Conclusion
- The most challenging tasks may be those in which predictions are used directly
  for downstream model- ling or decision-making, especially in the clinic. As an
  example, errors in sequence variant calling will be amplified if they are used
  directly for genome-wide association studies.
 
- In addition, the stochasticity and complexity of biological sys- tems imply
  that for some problems, for instance, predicting gene regulation in disease,
  perfect accuracy will be unattainable
 
* WAIT Deelder2019 - Machine Learning Predicts Accurately Mycobacterium tuberculosis Drug Resistance From Whole Genome Sequencing Data
** Notes
- Need to request code from authors
  EMILYN: Ask Jody for the code for this paper. Perhaps this code is used inside
  tb-profiler and if we could improve the ML model, this could be included in tb-profiler.
- Good ML oriented paper
** FileName
- Deelder2019_MLPredictsAccurately.pdf
** Abstract
- We applied machine learning approaches to 16,688 M. tuberculosis isolates that
  have undergone WGS and laboratory drug-susceptibility testing (DST) across 14
  antituberculosis drugs, with 22.5% of samples being multidrug resistant and
  2.1% being extensively drug resistant.
 
- We fitted separate models for each drug, with and without “co-occurrent
  resistance” markers known to be causing resistance to drugs other than the one
  of interest. Predictive performance was measured using sensitivity,
  specificity, and the area under the receiver operating characteristic curve,
  assuming DST results as the gold standard.

- Overall, the gradient-boosted-tree models performed better than the
  classification-tree models.

- Our work demonstrates the utility of machine learning as a flexible approach
  to drug resistance prediction that is able to accommodate a much larger number
  of predictors and to summarize their predictive ability, thus assisting
  clinical decision making and single nucleotide polymorphism detection in an
  era of increasing WGS data generation.
 
** Conclusion

- The predictive performance was highest for resistance to first-line drugs,
  and multidrug-resistant tuberculosis (area under the receiver operating characteristic curve above
  96%), and lowest for third- line drugs (area under the curve below 85%).
 
** Supplementary
*** Deelder2019_MLPredictsAccurately_Data_Sheet_1.pdf
* [?] Djout2016 - Predictive modeling targets thymidylate synthase ThyX in Mycobacterium tuberculosis
** Notes
- This requires more knowledge of chemistry and perhaps also relies on lab based experiments
** FileName
- Djout2016_PredictiveModeling.pdf
** Abstract
- ThyX is an essential thymidylate synthase
that is mechanistically and structurally unrelated to the human enzyme. DNA
gyrase is a DNA topoisomerase present in bacteria and plants but not animals.
The current study set out to understand the structure-activity relationships of
these targets in Mtb using a combination of cheminformatics and in vitro
screening.
** Conclusion
* STRT Donohue2018 - Increasing nontuberculous mycobacteria reporting rates and species diversity identified in clinical laboratory reports
** Notes
- This is a survey report about NTM across a couple decades.
- Could be used in building up the background context
  EMILYN: This could be used in discussion.
** FileName
- Donohue2018_IncreasingNTMReportingRates.pdf
** Abstract
- Changes in NTM diversity were observed in complex/groups known to be
  clinically significant. Between 1994 and 2014 the rate implicating M.
  abscesses-chelonae group and M. avium complex increased by 322 and 149%,
  respectively.
** Conclusion
- Knowledge of the NTM species most frequently associ- ated with adverse human
  health consequences will assist epidemiological investigators to identify
  likely sources and modes of exposure associated with these types of in-
  fections.
- As the U.S. population ages, the public health burden from NTM associated
  disorders is expected to increase.
 
* [-] Doshi2017 - Tuberculosis control, and the where and why of artificial intelligence
** Notes
- Survey paper
- Can be used for building background context
** FileName
- Doshi2017_TuberculosisControl.pdf
** Abstract
** Conclusion
* [X] Ekins2013 - Enhancing Hit Identification in Mycobacterium tuberculosis Drug Discovery Using Validated Dual-Event Bayesian Models
** Notes
- Requires too much domain knowledge
- Perhaps uses an older technique i.e. HTS for analysis
- Could use other algorithms on the data used in this study
** FileName
- Ekins2013_EnhancingHitIdentification.pdf
