TopicResearch/Mycobacterium/_Resources.html
<div id="outline-container-orgab82770" class="outline-3">
<h3 id="orgab82770"><span class="section-number-3">10.2</span> FileName</h3>
<div class="outline-text-3" id="text-10-2">
<ul class="org-ul">
<li>Ching2018<sub>OpportunitiesAndObstaclesForDLInBiology.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-orgeae9cc2" class="outline-3">
<h3 id="orgeae9cc2"><span class="section-number-3">10.3</span> Abstract</h3>
<div class="outline-text-3" id="text-10-3">
<ul class="org-ul">
<li>Following from an extensive literature review, we find that deep learning has
yet to revolutionize biomedicine or definitively resolve any of the most
pressing challenges in the field, but promising advances have been made on the
prior state of the art</li>
<li>The limited amount of labelled data for training presents problems in some
domains, as do legal and privacy constraints on work with sensitive health
records.</li>
</ul>
</div>
</div>

<div id="outline-container-org9788566" class="outline-3">
<h3 id="org9788566"><span class="section-number-3">10.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-10-4">
<ul class="org-ul">
<li>The most challenging tasks may be those in which predictions are used directly
for downstream model- ling or decision-making, especially in the clinic. As an
example, errors in sequence variant calling will be amplified if they are used
directly for genome-wide association studies.</li>

<li>In addition, the stochasticity and complexity of biological sys- tems imply
that for some problems, for instance, predicting gene regulation in disease,
perfect accuracy will be unattainable</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6cbfe18" class="outline-2">
<h2 id="org6cbfe18"><span class="section-number-2">11</span> <span class="todo WAIT">WAIT</span> Deelder2019 - Machine Learning Predicts Accurately Mycobacterium tuberculosis Drug Resistance From Whole Genome Sequencing Data</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org2b56346" class="outline-3">
<h3 id="org2b56346"><span class="section-number-3">11.1</span> Notes</h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li>Need to request code from authors
EMILYN: Ask Jody for the code for this paper. Perhaps this code is used inside
tb-profiler and if we could improve the ML model, this could be included in tb-profiler.</li>
<li>Good ML oriented paper</li>
</ul>
</div>
</div>
<div id="outline-container-org27d6392" class="outline-3">
<h3 id="org27d6392"><span class="section-number-3">11.2</span> FileName</h3>
<div class="outline-text-3" id="text-11-2">
<ul class="org-ul">
<li>Deelder2019<sub>MLPredictsAccurately.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org856c6ab" class="outline-3">
<h3 id="org856c6ab"><span class="section-number-3">11.3</span> Abstract</h3>
<div class="outline-text-3" id="text-11-3">
<ul class="org-ul">
<li>We applied machine learning approaches to 16,688 M. tuberculosis isolates that
have undergone WGS and laboratory drug-susceptibility testing (DST) across 14
antituberculosis drugs, with 22.5% of samples being multidrug resistant and
2.1% being extensively drug resistant.</li>

<li>We fitted separate models for each drug, with and without “co-occurrent
resistance” markers known to be causing resistance to drugs other than the one
of interest. Predictive performance was measured using sensitivity,
specificity, and the area under the receiver operating characteristic curve,
assuming DST results as the gold standard.</li>

<li>Overall, the gradient-boosted-tree models performed better than the
classification-tree models.</li>

<li>Our work demonstrates the utility of machine learning as a flexible approach
to drug resistance prediction that is able to accommodate a much larger number
of predictors and to summarize their predictive ability, thus assisting
clinical decision making and single nucleotide polymorphism detection in an
era of increasing WGS data generation.</li>
</ul>
</div>
</div>

<div id="outline-container-org31498b4" class="outline-3">
<h3 id="org31498b4"><span class="section-number-3">11.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-11-4">
<ul class="org-ul">
<li>The predictive performance was highest for resistance to first-line drugs,
and multidrug-resistant tuberculosis (area under the receiver operating characteristic curve above
96%), and lowest for third- line drugs (area under the curve below 85%).</li>
</ul>
</div>
</div>

<div id="outline-container-org4acfce8" class="outline-3">
<h3 id="org4acfce8"><span class="section-number-3">11.5</span> Supplementary</h3>
<div class="outline-text-3" id="text-11-5">
</div>
<div id="outline-container-org23f4eb8" class="outline-4">
<h4 id="org23f4eb8"><span class="section-number-4">11.5.1</span> Deelder2019<sub>MLPredictsAccurately</sub><sub>Data</sub><sub>Sheet</sub><sub>1.pdf</sub></h4>
</div>
</div>
</div>
<div id="outline-container-orgd1b6c19" class="outline-2">
<h2 id="orgd1b6c19"><span class="section-number-2">12</span> <span class="todo ___">[?]</span> Djout2016 - Predictive modeling targets thymidylate synthase ThyX in Mycobacterium tuberculosis</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org431a354" class="outline-3">
<h3 id="org431a354"><span class="section-number-3">12.1</span> Notes</h3>
<div class="outline-text-3" id="text-12-1">
<ul class="org-ul">
<li>This requires more knowledge of chemistry and perhaps also relies on lab based experiments</li>
</ul>
</div>
</div>
<div id="outline-container-orgc6417ce" class="outline-3">
<h3 id="orgc6417ce"><span class="section-number-3">12.2</span> FileName</h3>
<div class="outline-text-3" id="text-12-2">
<ul class="org-ul">
<li>Djout2016<sub>PredictiveModeling.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-orgd9ccb82" class="outline-3">
<h3 id="orgd9ccb82"><span class="section-number-3">12.3</span> Abstract</h3>
<div class="outline-text-3" id="text-12-3">
<ul class="org-ul">
<li>ThyX is an essential thymidylate synthase</li>
</ul>
<p>
that is mechanistically and structurally unrelated to the human enzyme. DNA
gyrase is a DNA topoisomerase present in bacteria and plants but not animals.
The current study set out to understand the structure-activity relationships of
these targets in Mtb using a combination of cheminformatics and in vitro
screening.
</p>
</div>
</div>
<div id="outline-container-org0062525" class="outline-3">
<h3 id="org0062525"><span class="section-number-3">12.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-orgf9684f6" class="outline-2">
<h2 id="orgf9684f6"><span class="section-number-2">13</span> <span class="todo STRT">STRT</span> Donohue2018 - Increasing nontuberculous mycobacteria reporting rates and species diversity identified in clinical laboratory reports</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orga737675" class="outline-3">
<h3 id="orga737675"><span class="section-number-3">13.1</span> Notes</h3>
<div class="outline-text-3" id="text-13-1">
<ul class="org-ul">
<li>This is a survey report about NTM across a couple decades.</li>
<li>Could be used in building up the background context
EMILYN: This could be used in discussion.</li>
</ul>
</div>
</div>
<div id="outline-container-org6ec5335" class="outline-3">
<h3 id="org6ec5335"><span class="section-number-3">13.2</span> FileName</h3>
<div class="outline-text-3" id="text-13-2">
<ul class="org-ul">
<li>Donohue2018<sub>IncreasingNTMReportingRates.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org39f1227" class="outline-3">
<h3 id="org39f1227"><span class="section-number-3">13.3</span> Abstract</h3>
<div class="outline-text-3" id="text-13-3">
<ul class="org-ul">
<li>Changes in NTM diversity were observed in complex/groups known to be
clinically significant. Between 1994 and 2014 the rate implicating M.
abscesses-chelonae group and M. avium complex increased by 322 and 149%,
respectively.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd9a67c6" class="outline-3">
<h3 id="orgd9a67c6"><span class="section-number-3">13.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-13-4">
<ul class="org-ul">
<li>Knowledge of the NTM species most frequently associ- ated with adverse human
health consequences will assist epidemiological investigators to identify
likely sources and modes of exposure associated with these types of in-
fections.</li>
<li>As the U.S. population ages, the public health burden from NTM associated
disorders is expected to increase.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4293c3b" class="outline-2">
<h2 id="org4293c3b"><span class="section-number-2">14</span> <span class="todo ___">[-]</span> Doshi2017 - Tuberculosis control, and the where and why of artificial intelligence</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-orgc6e6bab" class="outline-3">
<h3 id="orgc6e6bab"><span class="section-number-3">14.1</span> Notes</h3>
<div class="outline-text-3" id="text-14-1">
<ul class="org-ul">
<li>Survey paper</li>
<li>Can be used for building background context</li>
</ul>
</div>
</div>
<div id="outline-container-org922047b" class="outline-3">
<h3 id="org922047b"><span class="section-number-3">14.2</span> FileName</h3>
<div class="outline-text-3" id="text-14-2">
<ul class="org-ul">
<li>Doshi2017<sub>TuberculosisControl.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org3ab3f5b" class="outline-3">
<h3 id="org3ab3f5b"><span class="section-number-3">14.3</span> Abstract</h3>
</div>
<div id="outline-container-org0f65e4f" class="outline-3">
<h3 id="org0f65e4f"><span class="section-number-3">14.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-org6cc35d9" class="outline-2">
<h2 id="org6cc35d9"><span class="section-number-2">15</span> <span class="done _X_">[X]</span> Ekins2013 - Enhancing Hit Identification in Mycobacterium tuberculosis Drug Discovery Using Validated Dual-Event Bayesian Models</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-orgc34f6de" class="outline-3">
<h3 id="orgc34f6de"><span class="section-number-3">15.1</span> Notes</h3>
<div class="outline-text-3" id="text-15-1">
<ul class="org-ul">
<li>Requires too much domain knowledge</li>
<li>Perhaps uses an older technique i.e. HTS for analysis</li>
<li>Could use other algorithms on the data used in this study</li>
</ul>
</div>
</div>
<div id="outline-container-org46e54cb" class="outline-3">
<h3 id="org46e54cb"><span class="section-number-3">15.2</span> FileName</h3>
<div class="outline-text-3" id="text-15-2">
<ul class="org-ul">
<li>Ekins2013<sub>EnhancingHitIdentification.pdf</sub></li>
</ul>
</div>
</div>
