TopicResearch/Mycobacterium/_Resources.html
<div id="outline-container-org69459be" class="outline-3">
<h3 id="org69459be"><span class="section-number-3">15.3</span> Abstract</h3>
<div class="outline-text-3" id="text-15-3">
<ul class="org-ul">
<li>High-throughput screening (HTS) in whole cells is widely pursued to find
compounds active against Mycobacterium tuberculosis (Mtb) for further
development towards new tuberculosis (TB) drugs</li>
<li>We have recently built and validated Bayesian machine learning models for
predicting compounds with activity against Mtb based on publicly available
large-scale HTS data from the Tuberculosis Antimicrobial Acquisition
Coordinating Facility</li>
</ul>
</div>
</div>
<div id="outline-container-org1427865" class="outline-3">
<h3 id="org1427865"><span class="section-number-3">15.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-orgeec8a60" class="outline-2">
<h2 id="orgeec8a60"><span class="section-number-2">16</span> <span class="done _X_">[X]</span> Ekins2013 - Fusing Dual-Event Data Sets for Mycobacterium tuberculosis Machine Learning Models and Their Evaluation</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-orgc086304" class="outline-3">
<h3 id="orgc086304"><span class="section-number-3">16.1</span> Notes</h3>
<div class="outline-text-3" id="text-16-1">
<ul class="org-ul">
<li>Requires too much domain knowledge</li>
<li>Perhaps uses an older technique i.e. HTS for analysis</li>
<li>Could use other algorithms on the data used in this study</li>
</ul>
</div>
</div>
<div id="outline-container-org5023c9c" class="outline-3">
<h3 id="org5023c9c"><span class="section-number-3">16.2</span> FileName</h3>
<div class="outline-text-3" id="text-16-2">
<ul class="org-ul">
<li>Ekins2013<sub>FusingDualEvent.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org75e3d14" class="outline-3">
<h3 id="org75e3d14"><span class="section-number-3">16.3</span> Abstract</h3>
<div class="outline-text-3" id="text-16-3">
<ul class="org-ul">
<li>A cheminformatics data-fusion</li>
</ul>
<p>
approach followed by Bayesian machine learning, Support Vector Machine, or Recursive
Partitioning model development (based on publicly available Mtb screening data) was used to
compare individual data sets and subsequent combined models.
</p>
<ul class="org-ul">
<li>We demonstrate that</li>
</ul>
<p>
combining three data sets incorporating antitubercular and cytotoxicity data in Vero cells
from our previous screens results in external validation receiver operator curve (ROC) of
0.83 (Bayesian or RP Forest)
</p>
</div>
</div>
<div id="outline-container-orga7b7477" class="outline-3">
<h3 id="orga7b7477"><span class="section-number-3">16.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-org0fb76b4" class="outline-2">
<h2 id="org0fb76b4"><span class="section-number-2">17</span> <span class="done _X_">[X]</span> Ekins2014<sub>AreBiggerDataSets.pdf</sub></h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-org051540e" class="outline-3">
<h3 id="org051540e"><span class="section-number-3">17.1</span> Notes</h3>
<div class="outline-text-3" id="text-17-1">
<ul class="org-ul">
<li>Requires too much domain knowledge</li>
<li>Perhaps uses an older technique i.e. HTS for analysis</li>
<li>Could use other algorithms on the data used in this study</li>
</ul>
</div>
</div>
<div id="outline-container-orgd01e027" class="outline-3">
<h3 id="orgd01e027"><span class="section-number-3">17.2</span> Title</h3>
</div>
<div id="outline-container-orgf84f2d8" class="outline-3">
<h3 id="orgf84f2d8"><span class="section-number-3">17.3</span> Abstract</h3>
</div>
<div id="outline-container-org07c827c" class="outline-3">
<h3 id="org07c827c"><span class="section-number-3">17.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-org914fdf0" class="outline-2">
<h2 id="org914fdf0"><span class="section-number-2">18</span> <span class="done _X_">[X]</span> Ekins2014<sub>CombiningComputationalMethods.pdf</sub></h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-org0762453" class="outline-3">
<h3 id="org0762453"><span class="section-number-3">18.1</span> Notes</h3>
<div class="outline-text-3" id="text-18-1">
<ul class="org-ul">
<li>Requires too much domain knowledge</li>
<li>Perhaps uses an older technique i.e. HTS for analysis</li>
<li>Could use other algorithms on the data used in this study</li>
</ul>
</div>
</div>
<div id="outline-container-orgc060b52" class="outline-3">
<h3 id="orgc060b52"><span class="section-number-3">18.2</span> Title</h3>
</div>
<div id="outline-container-org4c07fa7" class="outline-3">
<h3 id="org4c07fa7"><span class="section-number-3">18.3</span> Abstract</h3>
</div>
<div id="outline-container-org6ca8159" class="outline-3">
<h3 id="org6ca8159"><span class="section-number-3">18.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-org03d038c" class="outline-2">
<h2 id="org03d038c"><span class="section-number-2">19</span> <span class="done _X_">[X]</span> Ekins2016<sub>MachineLearningModel.pdf</sub></h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-org6e8da0a" class="outline-3">
<h3 id="org6e8da0a"><span class="section-number-3">19.1</span> Notes</h3>
<div class="outline-text-3" id="text-19-1">
<ul class="org-ul">
<li>Requires too much domain knowledge</li>
<li>Perhaps uses an older technique i.e. HTS for analysis</li>
<li>Could use other algorithms on the data used in this study</li>
</ul>
</div>
</div>
<div id="outline-container-org2df7156" class="outline-3">
<h3 id="org2df7156"><span class="section-number-3">19.2</span> Title</h3>
</div>
<div id="outline-container-orgc6b6a47" class="outline-3">
<h3 id="orgc6b6a47"><span class="section-number-3">19.3</span> Abstract</h3>
</div>
<div id="outline-container-orgc708f08" class="outline-3">
<h3 id="orgc708f08"><span class="section-number-3">19.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-org31dc89c" class="outline-2">
<h2 id="org31dc89c"><span class="section-number-2">20</span> <span class="done _X_">[X]</span> Ekins2017<sub>MachineLearning.pdf</sub></h2>
<div class="outline-text-2" id="text-20">
</div>
<div id="outline-container-org77271bc" class="outline-3">
<h3 id="org77271bc"><span class="section-number-3">20.1</span> Notes</h3>
<div class="outline-text-3" id="text-20-1">
<ul class="org-ul">
<li>Requires too much domain knowledge</li>
<li>Perhaps uses an older technique i.e. HTS for analysis</li>
<li>Could use other algorithms on the data used in this study</li>
</ul>
</div>
</div>
<div id="outline-container-org49a22de" class="outline-3">
<h3 id="org49a22de"><span class="section-number-3">20.2</span> Title</h3>
</div>
<div id="outline-container-org9219c8a" class="outline-3">
<h3 id="org9219c8a"><span class="section-number-3">20.3</span> Abstract</h3>
</div>
<div id="outline-container-org6d5d88c" class="outline-3">
<h3 id="org6d5d88c"><span class="section-number-3">20.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-org0b14e0a" class="outline-2">
<h2 id="org0b14e0a"><span class="section-number-2">21</span> <span class="todo ___">[-]</span> Engle2019 - Performance of Qure.ai automatic classifiers against a large annotated database of patients with diverse forms of tuberculosis</h2>
<div class="outline-text-2" id="text-21">
</div>
<div id="outline-container-orgf45bb2e" class="outline-3">
<h3 id="orgf45bb2e"><span class="section-number-3">21.1</span> Notes</h3>
<div class="outline-text-3" id="text-21-1">
<ul class="org-ul">
<li>Image processing</li>
<li>Mentiones the database source, NIH</li>
<li>Has CSV as supplementary data</li>
</ul>
</div>
</div>
<div id="outline-container-orgbf3c921" class="outline-3">
<h3 id="orgbf3c921"><span class="section-number-3">21.2</span> FileName</h3>
<div class="outline-text-3" id="text-21-2">
<ul class="org-ul">
<li>Engle2019<sub>PerformanceOfQureAI.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org15feb0d" class="outline-3">
<h3 id="org15feb0d"><span class="section-number-3">21.3</span> Abstract</h3>
<div class="outline-text-3" id="text-21-3">
<ul class="org-ul">
<li>Availability of trained radiologists for fast processing of CXRs in regions
burdened with tuberculosis always has been a challenge, affecting both timely
diagnosis and patient monitoring.</li>

<li>The Qure.ai qXR arti- ficial intelligence automated CXR interpretation tool,
was blind-tested on the 346 radiologist- annotated CXRs from the TBPP
database.</li>

<li>We conclude that applying fully automated Qure.ai CXR analysis tool is useful
for fast, accurate, uniform, large-scale CXR annotation assistance, as it
performed well even for DR-TB cases that were not used for initial training.</li>
</ul>
</div>
</div>

<div id="outline-container-orgec53136" class="outline-3">
<h3 id="orgec53136"><span class="section-number-3">21.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-21-4">
<ul class="org-ul">
<li>We demonstrated that the Qure.ai qXR CXR annotations for cavity, nodule,
pleural effusion, and hilar lymphadenopathy, are in statistical agreement with
radiologist CXR annotations.</li>

<li>A corresponding analysis of patient case matched
CT image annotations recorded within 30 days of a CXR supports this result,
demonstrating statistical significance for cavity, pleural effusion, hilar
lymphadenopathy, and atelectasis.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org95a0312" class="outline-2">
<h2 id="org95a0312"><span class="section-number-2">22</span> <span class="todo ___">[-]</span> Greif2020 - Species Distribution and Isolation Frequency of Nontuberculous Mycobacteria, Uruguay</h2>
<div class="outline-text-2" id="text-22">
</div>
<div id="outline-container-org01eb91e" class="outline-3">
<h3 id="org01eb91e"><span class="section-number-3">22.1</span> Notes</h3>
<div class="outline-text-3" id="text-22-1">
<ul class="org-ul">
<li>Survey paper</li>
</ul>
</div>
</div>
<div id="outline-container-orgd52acda" class="outline-3">
<h3 id="orgd52acda"><span class="section-number-3">22.2</span> FileName</h3>
<div class="outline-text-3" id="text-22-2">
<ul class="org-ul">
<li>Greif2020<sub>FrequencyOfNTM.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org5dc068e" class="outline-3">
<h3 id="org5dc068e"><span class="section-number-3">22.3</span> Abstract</h3>
<div class="outline-text-3" id="text-22-3">
<ul class="org-ul">
<li>Nontuberculous mycobacteria (NTM) increasingly are recognized as
opportunistic pathogens of humans.</li>
<li>NTM species distribution is well documented in Europe and North America</li>
</ul>
</div>
</div>
<div id="outline-container-org841c69b" class="outline-3">
<h3 id="org841c69b"><span class="section-number-3">22.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-22-4">
<ul class="org-ul">
<li>Our findings indicate that rate of NTM have risen nearly 5-fold (4.79) in
Uruguay, from 0.33 cas- es/100,000 inhabitants in 2006 to 1.57 cases/100,000
inhabitants in 2018.</li>
</ul>
</div>
</div>
</div>
