TopicResearch/Mycobacterium/_Resources.org
** Notes
- Can perform the mentioned analysis on the MTB and NTM data
- The paper focuses on the factors affecting the application and clinical application of ML models
** FileName
- Hicks2019_EvaluationOfParameters.pdf
** Abstract
- There has been no systematic evaluation of factors that may influence
  performance of ML models, how they might apply to and vary across clinical
  populations, and what the implications might be in the clinical setting
 
- We performed a meta-analysis of seven large Neisseria gonorrhoeae datasets, as
  well as Klebsiella pneumoniae and Acinetobacter baumannii datasets, with whole
  genome sequence data and antibiotic susceptibility phenotypes using set
  covering machine classifi- cation, random forest classification, and random
  forest regression models to predict resis- tance phenotypes from genotype.
 
- We demonstrate how model performance varies by drug, dataset, resistance
  metric, and species, reflecting the complexities of generating clinically
  relevant conclusions from machine learning-derived models.

- Our results highlight significant biological and technical challenges
  facing the application of machine learning-based prediction of antibiotic
  resistance as a diagnostic tool.

** Conclusion
* [X] Hussain2018 - Predicting treatment outcome of drug-susceptible tuberculosis patients using machine-learning models
** Notes
- Can use a different algorithm (XgBoost) on the dataset
- Sample data and complete code is shared
  https://github.com/biosharp-dotnet/tuberculosis-predictive-analytics
- Need to find the full dataset of 4000 surveyed patients
  EMILYN: Please try to find the data
** FileName
- Hussain2018_PredictingTreatmentOutcomes.pdf
** Abstract
- Tuberculosis (TB) is a deadly contagious disease and a serious global health
  problem. It is curable but due to its lengthy treatment process, a patient is
  likely to leave the treatment incomplete, leading to a more lethal, drug
  resistant form of disease.
 
- We aim to facilitate TB programs by predicting the outcome of the treatment of
  a particular patient at the start of treatment so that their health workers
  can be utilized in a targeted and cost-effective way.

- The problem was modeled as a classification problem, and the outcome of
  treatment was predicted using state-of-art implementations of 3 machine learning algorithms
 
** Conclusion
- Empirical results using data of more than 4000 patients reveal that we can
  predict with more than 76% accuracy whether a TB patient would complete his (or her) treatment or not
-
* WAIT Jamal2020 - Artificial Intelligence and Machine learning based prediction of resistant and susceptible mutations in Mycobacterium tuberculosis
EMILYN: This is interesting and will read this paper. Perhaps can find/propose
other projects and studies
** Notes
- Used many ML algorithms, 85% accuracy
- Could use XgBoost
- Could conduct a similar study for NTM
  EMILYN: This can't be used for NTM as drug database doesn't exist.
- Mentions many online bio databases
- Touches on BioChemistry
** FileName
- Jamal2020_AIAndMLBasedPredictive.pdf
** Abstract
- The present work is a computational framework that uses artificial
  intelligence (AI) based machine learning (ML) approaches for predicting
  resistance in the genes rpoB, inhA, katG, pncA, gyrA and gyrB for the drugs
  rifampicin, isoniazid, pyrazinamide and fluoroquinolones

- The single nucleotide variations were represented by several sequence and
  structural features that indicate the influence of mutations on the target
  protein coded by each gene.
 
** Conclusion

- The present study proposes an AI/ML method to classify resistant and susceptible
  mutations in TB and predict novel resistance conferring mutations.
 
- The impact of the reported mutations was captured in the form of changes in the amino acid
  residues, and the consequent change in properties vis-a-vis wild-type and mutant
  proteins and represented as features used to train the models.

- The classification model was generated for each gene and predictions were made for
  SNVs linked with each gene for each drug

* WAIT Kavvas2018 - Machine learning and structural analysis of Mycobacterium tuberculosis pan-genome identifies genetic signatures of antibiotic resistance
EMILYN: Please read this paper.
** Notes
- They developed and online platform
 
- Can be applied to NTM

- Code is available
  https://github.com/biosharp-dotnet/microbial_AMR_ML
** FileName
- Kavvas2018_MachineLearning_.pdf
** Abstract
- The many publicly available datasets describing its AMR characteristics demand
  disparate data-type analyses.
 
- Here, we develop a reference strain-agnostic computational platform that uses
  machine learning approaches, complemented by both genetic interaction analysis
  and 3D structural mutation-mapping, to identify signatures of AMR evolution to
  13 antibiotics.

- First, a pan-genome analysis shows that M. tuberculosis is highly conserved
  with sequenced variation concentrated in PE/PPE/PGRS genes.

- Second, the platform corroborates 33 genes known to confer resistance and identifies 24
  new genetic signatures of AMR.

- Third, 97 epistatic interactions across 10 resistance classes are revealed.

- Fourth, detailed structural analysis of these
  genes yields mechanistic bases for their selection.

- The platform can be used to study other human pathogens

