TopicResearch/Mycobacterium/_Resources.html

<div id="outline-container-orgb86575d" class="outline-2">
<h2 id="orgb86575d"><span class="section-number-2">23</span> <span class="todo ___">[-]</span> Hicks2019 - Evaluation of parameters affecting performance and reliability of machine learning-based antibiotic susceptibility testing from whole genome sequencing data</h2>
<div class="outline-text-2" id="text-23">
</div>
<div id="outline-container-orgd388bd6" class="outline-3">
<h3 id="orgd388bd6"><span class="section-number-3">23.1</span> Notes</h3>
<div class="outline-text-3" id="text-23-1">
<ul class="org-ul">
<li>Can perform the mentioned analysis on the MTB and NTM data</li>
<li>The paper focuses on the factors affecting the application and clinical application of ML models</li>
</ul>
</div>
</div>
<div id="outline-container-org8e6b88d" class="outline-3">
<h3 id="org8e6b88d"><span class="section-number-3">23.2</span> FileName</h3>
<div class="outline-text-3" id="text-23-2">
<ul class="org-ul">
<li>Hicks2019<sub>EvaluationOfParameters.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org1f6dc26" class="outline-3">
<h3 id="org1f6dc26"><span class="section-number-3">23.3</span> Abstract</h3>
<div class="outline-text-3" id="text-23-3">
<ul class="org-ul">
<li>There has been no systematic evaluation of factors that may influence
performance of ML models, how they might apply to and vary across clinical
populations, and what the implications might be in the clinical setting</li>

<li>We performed a meta-analysis of seven large Neisseria gonorrhoeae datasets, as
well as Klebsiella pneumoniae and Acinetobacter baumannii datasets, with whole
genome sequence data and antibiotic susceptibility phenotypes using set
covering machine classifi- cation, random forest classification, and random
forest regression models to predict resis- tance phenotypes from genotype.</li>

<li>We demonstrate how model performance varies by drug, dataset, resistance
metric, and species, reflecting the complexities of generating clinically
relevant conclusions from machine learning-derived models.</li>

<li>Our results highlight significant biological and technical challenges
facing the application of machine learning-based prediction of antibiotic
resistance as a diagnostic tool.</li>
</ul>
</div>
</div>

<div id="outline-container-org7f814aa" class="outline-3">
<h3 id="org7f814aa"><span class="section-number-3">23.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-orgcc12666" class="outline-2">
<h2 id="orgcc12666"><span class="section-number-2">24</span> <span class="done _X_">[X]</span> Hussain2018 - Predicting treatment outcome of drug-susceptible tuberculosis patients using machine-learning models</h2>
<div class="outline-text-2" id="text-24">
</div>
<div id="outline-container-org49f1e94" class="outline-3">
<h3 id="org49f1e94"><span class="section-number-3">24.1</span> Notes</h3>
<div class="outline-text-3" id="text-24-1">
<ul class="org-ul">
<li>Can use a different algorithm (XgBoost) on the dataset</li>
<li>Sample data and complete code is shared
<a href="https://github.com/biosharp-dotnet/tuberculosis-predictive-analytics">https://github.com/biosharp-dotnet/tuberculosis-predictive-analytics</a></li>
<li>Need to find the full dataset of 4000 surveyed patients
EMILYN: Please try to find the data</li>
</ul>
</div>
</div>
<div id="outline-container-org88b6ba4" class="outline-3">
<h3 id="org88b6ba4"><span class="section-number-3">24.2</span> FileName</h3>
<div class="outline-text-3" id="text-24-2">
<ul class="org-ul">
<li>Hussain2018<sub>PredictingTreatmentOutcomes.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org111d250" class="outline-3">
<h3 id="org111d250"><span class="section-number-3">24.3</span> Abstract</h3>
<div class="outline-text-3" id="text-24-3">
<ul class="org-ul">
<li>Tuberculosis (TB) is a deadly contagious disease and a serious global health
problem. It is curable but due to its lengthy treatment process, a patient is
likely to leave the treatment incomplete, leading to a more lethal, drug
resistant form of disease.</li>

<li>We aim to facilitate TB programs by predicting the outcome of the treatment of
a particular patient at the start of treatment so that their health workers
can be utilized in a targeted and cost-effective way.</li>

<li>The problem was modeled as a classification problem, and the outcome of
treatment was predicted using state-of-art implementations of 3 machine learning algorithms</li>
</ul>
</div>
</div>

<div id="outline-container-org911b57e" class="outline-3">
<h3 id="org911b57e"><span class="section-number-3">24.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-24-4">
<ul class="org-ul">
<li>Empirical results using data of more than 4000 patients reveal that we can
predict with more than 76% accuracy whether a TB patient would complete his (or her) treatment or not</li>
<li></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org42f08c9" class="outline-2">
<h2 id="org42f08c9"><span class="section-number-2">25</span> <span class="todo WAIT">WAIT</span> Jamal2020 - Artificial Intelligence and Machine learning based prediction of resistant and susceptible mutations in Mycobacterium tuberculosis</h2>
<div class="outline-text-2" id="text-25">
<p>
EMILYN: This is interesting and will read this paper. Perhaps can find/propose
other projects and studies
</p>
</div>
<div id="outline-container-orge988dcc" class="outline-3">
<h3 id="orge988dcc"><span class="section-number-3">25.1</span> Notes</h3>
<div class="outline-text-3" id="text-25-1">
<ul class="org-ul">
<li>Used many ML algorithms, 85% accuracy</li>
<li>Could use XgBoost</li>
<li>Could conduct a similar study for NTM
EMILYN: This can&rsquo;t be used for NTM as drug database doesn&rsquo;t exist.</li>
<li>Mentions many online bio databases</li>
<li>Touches on BioChemistry</li>
</ul>
</div>
</div>
<div id="outline-container-orgef78b44" class="outline-3">
<h3 id="orgef78b44"><span class="section-number-3">25.2</span> FileName</h3>
<div class="outline-text-3" id="text-25-2">
<ul class="org-ul">
<li>Jamal2020<sub>AIAndMLBasedPredictive.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org3b7214d" class="outline-3">
<h3 id="org3b7214d"><span class="section-number-3">25.3</span> Abstract</h3>
<div class="outline-text-3" id="text-25-3">
<ul class="org-ul">
<li>The present work is a computational framework that uses artificial
intelligence (AI) based machine learning (ML) approaches for predicting
resistance in the genes rpoB, inhA, katG, pncA, gyrA and gyrB for the drugs
rifampicin, isoniazid, pyrazinamide and fluoroquinolones</li>

<li>The single nucleotide variations were represented by several sequence and
structural features that indicate the influence of mutations on the target
protein coded by each gene.</li>
</ul>
</div>
</div>

<div id="outline-container-orgcf3b80d" class="outline-3">
<h3 id="orgcf3b80d"><span class="section-number-3">25.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-25-4">
<ul class="org-ul">
<li>The present study proposes an AI/ML method to classify resistant and susceptible
mutations in TB and predict novel resistance conferring mutations.</li>

<li>The impact of the reported mutations was captured in the form of changes in the amino acid
residues, and the consequent change in properties vis-a-vis wild-type and mutant
proteins and represented as features used to train the models.</li>

<li>The classification model was generated for each gene and predictions were made for
SNVs linked with each gene for each drug</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf8112f4" class="outline-2">
<h2 id="orgf8112f4"><span class="section-number-2">26</span> <span class="todo WAIT">WAIT</span> Kavvas2018 - Machine learning and structural analysis of Mycobacterium tuberculosis pan-genome identifies genetic signatures of antibiotic resistance</h2>
<div class="outline-text-2" id="text-26">
<p>
EMILYN: Please read this paper.
</p>
</div>
<div id="outline-container-orgf7aa7be" class="outline-3">
<h3 id="orgf7aa7be"><span class="section-number-3">26.1</span> Notes</h3>
<div class="outline-text-3" id="text-26-1">
<ul class="org-ul">
<li>They developed and online platform</li>

<li>Can be applied to NTM</li>

<li>Code is available
<a href="https://github.com/biosharp-dotnet/microbial_AMR_ML">https://github.com/biosharp-dotnet/microbial_AMR_ML</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd3857ee" class="outline-3">
<h3 id="orgd3857ee"><span class="section-number-3">26.2</span> FileName</h3>
<div class="outline-text-3" id="text-26-2">
<ul class="org-ul">
<li>Kavvas2018<sub>MachineLearning</sub><sub>.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org37851bc" class="outline-3">
<h3 id="org37851bc"><span class="section-number-3">26.3</span> Abstract</h3>
<div class="outline-text-3" id="text-26-3">
<ul class="org-ul">
<li>The many publicly available datasets describing its AMR characteristics demand
disparate data-type analyses.</li>

<li>Here, we develop a reference strain-agnostic computational platform that uses
machine learning approaches, complemented by both genetic interaction analysis
and 3D structural mutation-mapping, to identify signatures of AMR evolution to
13 antibiotics.</li>

<li>First, a pan-genome analysis shows that M. tuberculosis is highly conserved
with sequenced variation concentrated in PE/PPE/PGRS genes.</li>

<li>Second, the platform corroborates 33 genes known to confer resistance and identifies 24
new genetic signatures of AMR.</li>

<li>Third, 97 epistatic interactions across 10 resistance classes are revealed.</li>

<li>Fourth, detailed structural analysis of these
genes yields mechanistic bases for their selection.</li>

<li>The platform can be used to study other human pathogens</li>
</ul>
</div>
</div>
