TopicResearch/Mycobacterium/_Resources.org
** Conclusion

- The platform was applied to 1595 sequenced strains to yield results in four
  categories: pan-genome properties, identification of genes conferring
  antibiotic resistance, their epistatic interactions, and protein structure
  based mechanistic insights.
 
* [-] Khanna2018 - Ensemble Technique for Prediction of T-cell Mycobacterium tuberculosis Epitopes
** Notes
- Uses multiple bio and ML packages in R
- Doesn't use XgBoost or H20
- Code hasn't been shared
** FileName
- Khanna2018_EnsembleTechnique.pdf
** Abstract
- Development of an effective machine-learning model for T-cell Mycobacterium
  tuberculosis (M. tuberculosis) epitopes is beneficial for saving biologist’s
  time and effort for identifying epitope in a targeted antigen.
 
- The proposed method is able to work with variable length epitopes having size
  even greater than 9-mers. Identification of T-cell or B-cell epitopes in the
  targeted antigen is the main goal in designing epitope-based vaccine,
  immune-diagnostic tests and antibody production

- The proposed ensemble model achieves 82.0% accuracy, 0.89 specificity, 0.77
  sensitivity with repeated k-fold cross-validation having average accuracy of
  80.61%.
 
** Conclusion
- Three models (decision tree, avNNet and RRF) have been used to design the
  ensemble model which produces high accuracy, Gini, AUC, specificity and
  sensitivity.

- To validate and compare the proposed ensemble model, NetMHC 4.0, NetMHC 2.3
  and CTLpred servers have been considered.
 

* [-] Killian2019 - Learning to Prescribe Interventions for Tuberculosis Patients Using Digital Adherence Data
** Notes
- Wasn't able to find the data or the code in the paper
** FileName
- Killian2019_LearningToPrescribe.pdf
** Abstract
- We analyze data from one city served by 99DOTS, a phone-call- based DAT
  deployed for Tuberculosis (TB) treatment in India where nearly 3 million
  people are afflicted with the disease each year

- We then construct a deep learning model, demonstrate its interpretability, and
  show how it can be adapted and trained in three different clinical scenarios
  to better target and improve patient care.
 
** Conclusion
- We finally show that tailoring our model for a specific intervention via
  decision-focused learning can improve performance by a further 15%.
* WAIT Kouchaki2019 - Application of machine learning techniques to tuberculosis drug resistance analysis
** Notes
- I've asked the author to provide the source code via ResearchGate
- They've used 6 ML classifiers, not XgBoost or NeuralNetworks
** FileName
- Kouchaki2019_ApplicationOfML.pdf
** Abstract
- Machine learning methods have been widely applied for timely predicting
  resistance of MTB given a specific drug and identifying resistance markers.
  However, they have been not validated on a large cohort of MTB samples from
  multi-centers across the world in terms of resistance prediction and
  resistance marker identification

- Several machine learning classifiers and linear dimension re- duction
  techniques were developed and compared for a cohort of 13 402 isolates
  collected from 16 countries across 6 continents and tested 11 drugs.
 
** Conclusion
- Developing machine learning techniques is especially important to im- prove TB
  resistance prediction, mainly sensitivity for less-studied drugs.
-
** Supplementary
*** Kouchaki2019_ApplicationOfML_Supplementary.pdf
* DONE Kouchaki2020 - Multi-Label Random Forest Model for Tuberculosis Drug Resistance Classification and Mutation Ranking
EMILYN: Please think of some projects. Maybe take hints from Notes
** Notes
- Source code and data are both available

- Maybe use XgBoost or H2O
** FileName
- Kouchaki2020_MultiLabelRandomForest.pdf
** Abstract
- Due to standard regimens for the use of first-line antibiotics, resistance
  co-occurrence, in which samples are resistant to multiple drugs, is common.
  Analysing all drugs simultaneously should therefore enable patterns reflecting
  resistance co-occurrence to be exploited for resistance prediction

- Here, multi-label random forest (MLRF) models are compared with single-label
  random forest (SLRF) for both predicting phenotypic resistance from whole
  genome sequences and identifying important mutations for better prediction of
  four first-line drugs in a dataset of 13402 Mycobacterium tuberculosis
  isolates.
  
** Conclusion
** Supplementary
*** Kouchaki2020_MultiLabel.zip
*** Kouchaki2020_MultiLabel_DataSheet_1.pdf
*** Kouchaki2020_MultiLabel_DataSheet_2.pdf
* [-] Kovalishyn2019 - Hybrid Design of Isonicotinic Acid Hydrazide Derivatives: Machine Learning Studies, Synthesis and Biological Evaluation of their Anti- tuberculosis Activity
** Notes
- Is inclined more towards Chemistry (reagents) wrt TB
** FileName
- Kovalishyn2019_HybridDesign.pdf
