TopicResearch/Mycobacterium/_Resources.html

<div id="outline-container-orgcb5405a" class="outline-3">
<h3 id="orgcb5405a"><span class="section-number-3">26.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-26-4">
<ul class="org-ul">
<li>The platform was applied to 1595 sequenced strains to yield results in four
categories: pan-genome properties, identification of genes conferring
antibiotic resistance, their epistatic interactions, and protein structure
based mechanistic insights.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org55dfe62" class="outline-2">
<h2 id="org55dfe62"><span class="section-number-2">27</span> <span class="todo ___">[-]</span> Khanna2018 - Ensemble Technique for Prediction of T-cell Mycobacterium tuberculosis Epitopes</h2>
<div class="outline-text-2" id="text-27">
</div>
<div id="outline-container-org95ca24c" class="outline-3">
<h3 id="org95ca24c"><span class="section-number-3">27.1</span> Notes</h3>
<div class="outline-text-3" id="text-27-1">
<ul class="org-ul">
<li>Uses multiple bio and ML packages in R</li>
<li>Doesn&rsquo;t use XgBoost or H20</li>
<li>Code hasn&rsquo;t been shared</li>
</ul>
</div>
</div>
<div id="outline-container-org7bcf5f5" class="outline-3">
<h3 id="org7bcf5f5"><span class="section-number-3">27.2</span> FileName</h3>
<div class="outline-text-3" id="text-27-2">
<ul class="org-ul">
<li>Khanna2018<sub>EnsembleTechnique.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org4ba203e" class="outline-3">
<h3 id="org4ba203e"><span class="section-number-3">27.3</span> Abstract</h3>
<div class="outline-text-3" id="text-27-3">
<ul class="org-ul">
<li>Development of an effective machine-learning model for T-cell Mycobacterium
tuberculosis (M. tuberculosis) epitopes is beneficial for saving biologist’s
time and effort for identifying epitope in a targeted antigen.</li>

<li>The proposed method is able to work with variable length epitopes having size
even greater than 9-mers. Identification of T-cell or B-cell epitopes in the
targeted antigen is the main goal in designing epitope-based vaccine,
immune-diagnostic tests and antibody production</li>

<li>The proposed ensemble model achieves 82.0% accuracy, 0.89 specificity, 0.77
sensitivity with repeated k-fold cross-validation having average accuracy of
80.61%.</li>
</ul>
</div>
</div>

<div id="outline-container-org9180cf6" class="outline-3">
<h3 id="org9180cf6"><span class="section-number-3">27.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-27-4">
<ul class="org-ul">
<li>Three models (decision tree, avNNet and RRF) have been used to design the
ensemble model which produces high accuracy, Gini, AUC, specificity and
sensitivity.</li>

<li>To validate and compare the proposed ensemble model, NetMHC 4.0, NetMHC 2.3
and CTLpred servers have been considered.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org41a77f7" class="outline-2">
<h2 id="org41a77f7"><span class="section-number-2">28</span> <span class="todo ___">[-]</span> Killian2019 - Learning to Prescribe Interventions for Tuberculosis Patients Using Digital Adherence Data</h2>
<div class="outline-text-2" id="text-28">
</div>
<div id="outline-container-org62f9cb1" class="outline-3">
<h3 id="org62f9cb1"><span class="section-number-3">28.1</span> Notes</h3>
<div class="outline-text-3" id="text-28-1">
<ul class="org-ul">
<li>Wasn&rsquo;t able to find the data or the code in the paper</li>
</ul>
</div>
</div>
<div id="outline-container-org2d8d3a1" class="outline-3">
<h3 id="org2d8d3a1"><span class="section-number-3">28.2</span> FileName</h3>
<div class="outline-text-3" id="text-28-2">
<ul class="org-ul">
<li>Killian2019<sub>LearningToPrescribe.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-orgf7b752c" class="outline-3">
<h3 id="orgf7b752c"><span class="section-number-3">28.3</span> Abstract</h3>
<div class="outline-text-3" id="text-28-3">
<ul class="org-ul">
<li>We analyze data from one city served by 99DOTS, a phone-call- based DAT
deployed for Tuberculosis (TB) treatment in India where nearly 3 million
people are afflicted with the disease each year</li>

<li>We then construct a deep learning model, demonstrate its interpretability, and
show how it can be adapted and trained in three different clinical scenarios
to better target and improve patient care.</li>
</ul>
</div>
</div>

<div id="outline-container-orge1c8c9a" class="outline-3">
<h3 id="orge1c8c9a"><span class="section-number-3">28.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-28-4">
<ul class="org-ul">
<li>We finally show that tailoring our model for a specific intervention via
decision-focused learning can improve performance by a further 15%.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org799097a" class="outline-2">
<h2 id="org799097a"><span class="section-number-2">29</span> <span class="todo WAIT">WAIT</span> Kouchaki2019 - Application of machine learning techniques to tuberculosis drug resistance analysis</h2>
<div class="outline-text-2" id="text-29">
</div>
<div id="outline-container-org106060c" class="outline-3">
<h3 id="org106060c"><span class="section-number-3">29.1</span> Notes</h3>
<div class="outline-text-3" id="text-29-1">
<ul class="org-ul">
<li>I&rsquo;ve asked the author to provide the source code via ResearchGate</li>
<li>They&rsquo;ve used 6 ML classifiers, not XgBoost or NeuralNetworks</li>
</ul>
</div>
</div>
<div id="outline-container-org94270d2" class="outline-3">
<h3 id="org94270d2"><span class="section-number-3">29.2</span> FileName</h3>
<div class="outline-text-3" id="text-29-2">
<ul class="org-ul">
<li>Kouchaki2019<sub>ApplicationOfML.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-orga069eaa" class="outline-3">
<h3 id="orga069eaa"><span class="section-number-3">29.3</span> Abstract</h3>
<div class="outline-text-3" id="text-29-3">
<ul class="org-ul">
<li>Machine learning methods have been widely applied for timely predicting
resistance of MTB given a specific drug and identifying resistance markers.
However, they have been not validated on a large cohort of MTB samples from
multi-centers across the world in terms of resistance prediction and
resistance marker identification</li>

<li>Several machine learning classifiers and linear dimension re- duction
techniques were developed and compared for a cohort of 13 402 isolates
collected from 16 countries across 6 continents and tested 11 drugs.</li>
</ul>
</div>
</div>

<div id="outline-container-orge7c29f7" class="outline-3">
<h3 id="orge7c29f7"><span class="section-number-3">29.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-29-4">
<ul class="org-ul">
<li>Developing machine learning techniques is especially important to im- prove TB
resistance prediction, mainly sensitivity for less-studied drugs.</li>
<li></li>
</ul>
</div>
</div>
<div id="outline-container-org5eb2280" class="outline-3">
<h3 id="org5eb2280"><span class="section-number-3">29.5</span> Supplementary</h3>
<div class="outline-text-3" id="text-29-5">
</div>
<div id="outline-container-org7c6a8fc" class="outline-4">
<h4 id="org7c6a8fc"><span class="section-number-4">29.5.1</span> Kouchaki2019<sub>ApplicationOfML</sub><sub>Supplementary.pdf</sub></h4>
</div>
</div>
</div>
<div id="outline-container-orga83158f" class="outline-2">
<h2 id="orga83158f"><span class="section-number-2">30</span> <span class="done DONE">DONE</span> Kouchaki2020 - Multi-Label Random Forest Model for Tuberculosis Drug Resistance Classification and Mutation Ranking</h2>
<div class="outline-text-2" id="text-30">
<p>
EMILYN: Please think of some projects. Maybe take hints from Notes
</p>
</div>
<div id="outline-container-org9be3362" class="outline-3">
<h3 id="org9be3362"><span class="section-number-3">30.1</span> Notes</h3>
<div class="outline-text-3" id="text-30-1">
<ul class="org-ul">
<li>Source code and data are both available</li>

<li>Maybe use XgBoost or H2O</li>
</ul>
</div>
</div>
<div id="outline-container-org7f3c9bb" class="outline-3">
<h3 id="org7f3c9bb"><span class="section-number-3">30.2</span> FileName</h3>
<div class="outline-text-3" id="text-30-2">
<ul class="org-ul">
<li>Kouchaki2020<sub>MultiLabelRandomForest.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org0ba967d" class="outline-3">
<h3 id="org0ba967d"><span class="section-number-3">30.3</span> Abstract</h3>
<div class="outline-text-3" id="text-30-3">
<ul class="org-ul">
<li>Due to standard regimens for the use of first-line antibiotics, resistance
co-occurrence, in which samples are resistant to multiple drugs, is common.
Analysing all drugs simultaneously should therefore enable patterns reflecting
resistance co-occurrence to be exploited for resistance prediction</li>

<li>Here, multi-label random forest (MLRF) models are compared with single-label
random forest (SLRF) for both predicting phenotypic resistance from whole
genome sequences and identifying important mutations for better prediction of
four first-line drugs in a dataset of 13402 Mycobacterium tuberculosis
isolates.</li>
</ul>
</div>
</div>

<div id="outline-container-orgae759f4" class="outline-3">
<h3 id="orgae759f4"><span class="section-number-3">30.4</span> Conclusion</h3>
</div>
<div id="outline-container-org04124da" class="outline-3">
<h3 id="org04124da"><span class="section-number-3">30.5</span> Supplementary</h3>
<div class="outline-text-3" id="text-30-5">
</div>
<div id="outline-container-org1008759" class="outline-4">
<h4 id="org1008759"><span class="section-number-4">30.5.1</span> Kouchaki2020<sub>MultiLabel.zip</sub></h4>
</div>
<div id="outline-container-orga9b14aa" class="outline-4">
<h4 id="orga9b14aa"><span class="section-number-4">30.5.2</span> Kouchaki2020<sub>MultiLabel</sub><sub>DataSheet</sub><sub>1.pdf</sub></h4>
</div>
<div id="outline-container-orgf4cd826" class="outline-4">
<h4 id="orgf4cd826"><span class="section-number-4">30.5.3</span> Kouchaki2020<sub>MultiLabel</sub><sub>DataSheet</sub><sub>2.pdf</sub></h4>
</div>
</div>
</div>
<div id="outline-container-org3123fae" class="outline-2">
<h2 id="org3123fae"><span class="section-number-2">31</span> <span class="todo ___">[-]</span> Kovalishyn2019 - Hybrid Design of Isonicotinic Acid Hydrazide Derivatives: Machine Learning Studies, Synthesis and Biological Evaluation of their Anti- tuberculosis Activity</h2>
<div class="outline-text-2" id="text-31">
</div>
<div id="outline-container-orgdc0d077" class="outline-3">
<h3 id="orgdc0d077"><span class="section-number-3">31.1</span> Notes</h3>
<div class="outline-text-3" id="text-31-1">
<ul class="org-ul">
<li>Is inclined more towards Chemistry (reagents) wrt TB</li>
</ul>
</div>
</div>
<div id="outline-container-org36706ac" class="outline-3">
<h3 id="org36706ac"><span class="section-number-3">31.2</span> FileName</h3>
<div class="outline-text-3" id="text-31-2">
<ul class="org-ul">
<li>Kovalishyn2019<sub>HybridDesign.pdf</sub></li>
</ul>
</div>
</div>
