TopicResearch/Mycobacterium/_Resources.org
** Abstract
- The goal of this work is to identify potent small molecule anti-TB agents by
  machine learning, synthesis and biological evaluation.

- The On-line Chemical Database and Modeling Environment (OCHEM) was used to
  build pre- dictive machine learning models. Seven compounds were synthesized
  and tested in vitro for their an- titubercular activity against H37Rv and
  resistant Mtb strains.

-
** Conclusion
- The goal of this work was to investigate isoniazid- thiazole hybrid compounds
  taking into consideration the key structural futures known to be important for
  their antituber- cular activity.

- The created binary classification models demonstrated good balanced accuracy.
  The predictive power of the binary classifiers was tested by a 5-fold cross-
  validation and resulted in balanced accuracies of 61–78 %. Seven new compounds
  were synthesized and their activity against Mtb H37Rv and MDR strains was
  evaluated at two concentrations (1.5 and 50 μМ) using rifampin and isoniazid
  as controls.
 
* [-] Kumari2019 - A genetic programming-based approach to identify potential inhibitors of serine protease of Mycobacterium tuberculosis
** Notes
- Uses Genetic algorithms and ML algorithms as well
- Data or code isn't available
** FileName
- Kumari2019_AGeneticProgramming.pdf
** Abstract
- We applied genetic programming approaches to understand the impact of
  descriptors on inhibitory effects of serine protease inhibitors of
  Mycobacterium tuberculosis (Mtb) and the discovery of new in- hibitors as drug
  candidates

- The experimental dataset of serine protease inhibitors of Mtb descriptors was
  optimized by genetic algorithm (GA) along with the correlation-based feature
  selection (CFS) in order to develop predictive models using machine-learning
  algorithms.

- The use of CFS-GA with random forest-enhanced classification accuracy and
  predicted new serine protease inhibitors of Mtb, which can be used for better
  drug development against tuberculosis.
 
** Conclusion
-  Comparative analysis of statistical measures for four different
  machine-learning algorithms revealed that RF models with CFS-GA performed
  better than the others.

- The best RF models with CFS-GA predicted new serine protease inhibitors of
  Mtb, which can be used for better drug development against tuberculosis
 
* [-] Lai2019 - Comparison of the Predictive Outcomes for Anti-Tuberculosis Drug-Induced Hepatotoxicity by Different Machine Learning Techniques
** Notes
- Good ML oriented paper
- Can't find the data or code
** FileName
- Lai2019_ComparisonOfThePredictiveOutcomes.pdf
** Abstract
- The study compared the performance of artificial neural network, support
  vector machine and random forest on predicting anti-tuberculosis drugs induced
  hepatotoxicity.

- Combining genomic and clinical data can further increase the area under
  receiver operating characteristic curve than using genomic or clinical data
  alone.

- Nine models were created with 7 clinical factors and 4 genotypes
 
** Conclusion
* [-] Lane2018 - Comparing and Validating Machine Learning Models for Mycobacterium tuberculosis Drug Discovery
** Notes
- Involves chemistry
** FileName
- Lane2018_ComparingAndValidating.pdf
** Abstract
- The need to develop new treatments for those infected with Mycobacterium
  tuberculosis (Mtb) has led to many large-scale phenotypic screens and many
  thousands of new active compounds identified in vitro

- We have curated small molecule Mtb data and developed new models with a total
  of 18,886 molecules with activity cutoffs of 10 μM, 1 μM, and 100 nM. These
  data sets were used to evaluate different machine learning methods (including
  deep learning) and metrics and to generate predictions for additional
  molecules published in 2017

- We have also compared these models with additional machine learning algorithms
  showing Bayesian machine learning models con- structed with literature Mtb
  data generated by different laboratories generally were equivalent to or
  outperformed deep neural networks with external test sets.
 
** Conclusion
* [X] Lin2001 - Conserved codon composition of ribosomal protein coding genes in Escherichia coli, Mycobacterium tuberculosis and Saccharomyces cerevisiae: lessons from supervised machine learning in functional genomics
** Notes
- Deals with codons and homologs etc. No idea.
** FileName
- Lin2001_ConservedCodonComposition.pdf
** Abstract
** Conclusion
* [?] LokeshKumar2019 - Prediction of Multi Drug Resistant Tuberculosis using Machine Learning Techniques
** Notes
- Survey paper
- Offers quick overview of various algorithms with accuracy and other characteristics
** FileName
- LokeshKumar2019_PredictionOfMultiDrugResistant.pdf
** Abstract
- We review different Machine Learning Approaches to predict MDR-TB. Different
  feature estimation methods, execution of distinct machine learning models also
  have been explored.
- AdaBoost ensemble algorithm gave the highest accuracy of all
** Conclusion
* [X] Mahe2019 - A large scale evaluation of TBProfiler and Mykrobe for antibiotic resistance prediction in Mycobacterium tuberculosis
** Notes
- Doesn't directly relate to the dissertation
