TopicResearch/Mycobacterium/_Resources.html
<div id="outline-container-org8d36144" class="outline-3">
<h3 id="org8d36144"><span class="section-number-3">31.3</span> Abstract</h3>
<div class="outline-text-3" id="text-31-3">
<ul class="org-ul">
<li>The goal of this work is to identify potent small molecule anti-TB agents by
machine learning, synthesis and biological evaluation.</li>

<li>The On-line Chemical Database and Modeling Environment (OCHEM) was used to
build pre- dictive machine learning models. Seven compounds were synthesized
and tested in vitro for their an- titubercular activity against H37Rv and
resistant Mtb strains.</li>

<li></li>
</ul>
</div>
</div>
<div id="outline-container-org7a94d65" class="outline-3">
<h3 id="org7a94d65"><span class="section-number-3">31.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-31-4">
<ul class="org-ul">
<li>The goal of this work was to investigate isoniazid- thiazole hybrid compounds
taking into consideration the key structural futures known to be important for
their antituber- cular activity.</li>

<li>The created binary classification models demonstrated good balanced accuracy.
The predictive power of the binary classifiers was tested by a 5-fold cross-
validation and resulted in balanced accuracies of 61–78 %. Seven new compounds
were synthesized and their activity against Mtb H37Rv and MDR strains was
evaluated at two concentrations (1.5 and 50 μМ) using rifampin and isoniazid
as controls.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org901ec89" class="outline-2">
<h2 id="org901ec89"><span class="section-number-2">32</span> <span class="todo ___">[-]</span> Kumari2019 - A genetic programming-based approach to identify potential inhibitors of serine protease of Mycobacterium tuberculosis</h2>
<div class="outline-text-2" id="text-32">
</div>
<div id="outline-container-org537b1b7" class="outline-3">
<h3 id="org537b1b7"><span class="section-number-3">32.1</span> Notes</h3>
<div class="outline-text-3" id="text-32-1">
<ul class="org-ul">
<li>Uses Genetic algorithms and ML algorithms as well</li>
<li>Data or code isn&rsquo;t available</li>
</ul>
</div>
</div>
<div id="outline-container-org3bffb78" class="outline-3">
<h3 id="org3bffb78"><span class="section-number-3">32.2</span> FileName</h3>
<div class="outline-text-3" id="text-32-2">
<ul class="org-ul">
<li>Kumari2019<sub>AGeneticProgramming.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org5dafb05" class="outline-3">
<h3 id="org5dafb05"><span class="section-number-3">32.3</span> Abstract</h3>
<div class="outline-text-3" id="text-32-3">
<ul class="org-ul">
<li>We applied genetic programming approaches to understand the impact of
descriptors on inhibitory effects of serine protease inhibitors of
Mycobacterium tuberculosis (Mtb) and the discovery of new in- hibitors as drug
candidates</li>

<li>The experimental dataset of serine protease inhibitors of Mtb descriptors was
optimized by genetic algorithm (GA) along with the correlation-based feature
selection (CFS) in order to develop predictive models using machine-learning
algorithms.</li>

<li>The use of CFS-GA with random forest-enhanced classification accuracy and
predicted new serine protease inhibitors of Mtb, which can be used for better
drug development against tuberculosis.</li>
</ul>
</div>
</div>

<div id="outline-container-org513c1c3" class="outline-3">
<h3 id="org513c1c3"><span class="section-number-3">32.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-32-4">
<ul class="org-ul">
<li>Comparative analysis of statistical measures for four different
machine-learning algorithms revealed that RF models with CFS-GA performed
better than the others.</li>

<li>The best RF models with CFS-GA predicted new serine protease inhibitors of
Mtb, which can be used for better drug development against tuberculosis</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf3a0f5c" class="outline-2">
<h2 id="orgf3a0f5c"><span class="section-number-2">33</span> <span class="todo ___">[-]</span> Lai2019 - Comparison of the Predictive Outcomes for Anti-Tuberculosis Drug-Induced Hepatotoxicity by Different Machine Learning Techniques</h2>
<div class="outline-text-2" id="text-33">
</div>
<div id="outline-container-org775523b" class="outline-3">
<h3 id="org775523b"><span class="section-number-3">33.1</span> Notes</h3>
<div class="outline-text-3" id="text-33-1">
<ul class="org-ul">
<li>Good ML oriented paper</li>
<li>Can&rsquo;t find the data or code</li>
</ul>
</div>
</div>
<div id="outline-container-org48be139" class="outline-3">
<h3 id="org48be139"><span class="section-number-3">33.2</span> FileName</h3>
<div class="outline-text-3" id="text-33-2">
<ul class="org-ul">
<li>Lai2019<sub>ComparisonOfThePredictiveOutcomes.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org8788a2a" class="outline-3">
<h3 id="org8788a2a"><span class="section-number-3">33.3</span> Abstract</h3>
<div class="outline-text-3" id="text-33-3">
<ul class="org-ul">
<li>The study compared the performance of artificial neural network, support
vector machine and random forest on predicting anti-tuberculosis drugs induced
hepatotoxicity.</li>

<li>Combining genomic and clinical data can further increase the area under
receiver operating characteristic curve than using genomic or clinical data
alone.</li>

<li>Nine models were created with 7 clinical factors and 4 genotypes</li>
</ul>
</div>
</div>

<div id="outline-container-orgc2da543" class="outline-3">
<h3 id="orgc2da543"><span class="section-number-3">33.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-orge57d55e" class="outline-2">
<h2 id="orge57d55e"><span class="section-number-2">34</span> <span class="todo ___">[-]</span> Lane2018 - Comparing and Validating Machine Learning Models for Mycobacterium tuberculosis Drug Discovery</h2>
<div class="outline-text-2" id="text-34">
</div>
<div id="outline-container-org9a3c98a" class="outline-3">
<h3 id="org9a3c98a"><span class="section-number-3">34.1</span> Notes</h3>
<div class="outline-text-3" id="text-34-1">
<ul class="org-ul">
<li>Involves chemistry</li>
</ul>
</div>
</div>
<div id="outline-container-org021950e" class="outline-3">
<h3 id="org021950e"><span class="section-number-3">34.2</span> FileName</h3>
<div class="outline-text-3" id="text-34-2">
<ul class="org-ul">
<li>Lane2018<sub>ComparingAndValidating.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-orge96fb12" class="outline-3">
<h3 id="orge96fb12"><span class="section-number-3">34.3</span> Abstract</h3>
<div class="outline-text-3" id="text-34-3">
<ul class="org-ul">
<li>The need to develop new treatments for those infected with Mycobacterium
tuberculosis (Mtb) has led to many large-scale phenotypic screens and many
thousands of new active compounds identified in vitro</li>

<li>We have curated small molecule Mtb data and developed new models with a total
of 18,886 molecules with activity cutoffs of 10 μM, 1 μM, and 100 nM. These
data sets were used to evaluate different machine learning methods (including
deep learning) and metrics and to generate predictions for additional
molecules published in 2017</li>

<li>We have also compared these models with additional machine learning algorithms
showing Bayesian machine learning models con- structed with literature Mtb
data generated by different laboratories generally were equivalent to or
outperformed deep neural networks with external test sets.</li>
</ul>
</div>
</div>

<div id="outline-container-orgefed891" class="outline-3">
<h3 id="orgefed891"><span class="section-number-3">34.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-orgfe6b046" class="outline-2">
<h2 id="orgfe6b046"><span class="section-number-2">35</span> <span class="done _X_">[X]</span> Lin2001 - Conserved codon composition of ribosomal protein coding genes in Escherichia coli, Mycobacterium tuberculosis and Saccharomyces cerevisiae: lessons from supervised machine learning in functional genomics</h2>
<div class="outline-text-2" id="text-35">
</div>
<div id="outline-container-orgc2a806b" class="outline-3">
<h3 id="orgc2a806b"><span class="section-number-3">35.1</span> Notes</h3>
<div class="outline-text-3" id="text-35-1">
<ul class="org-ul">
<li>Deals with codons and homologs etc. No idea.</li>
</ul>
</div>
</div>
<div id="outline-container-orgee3a42b" class="outline-3">
<h3 id="orgee3a42b"><span class="section-number-3">35.2</span> FileName</h3>
<div class="outline-text-3" id="text-35-2">
<ul class="org-ul">
<li>Lin2001<sub>ConservedCodonComposition.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org0e1e902" class="outline-3">
<h3 id="org0e1e902"><span class="section-number-3">35.3</span> Abstract</h3>
</div>
<div id="outline-container-org20e73e0" class="outline-3">
<h3 id="org20e73e0"><span class="section-number-3">35.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-org3320a29" class="outline-2">
<h2 id="org3320a29"><span class="section-number-2">36</span> <span class="todo ___">[?]</span> LokeshKumar2019 - Prediction of Multi Drug Resistant Tuberculosis using Machine Learning Techniques</h2>
<div class="outline-text-2" id="text-36">
</div>
<div id="outline-container-org7253372" class="outline-3">
<h3 id="org7253372"><span class="section-number-3">36.1</span> Notes</h3>
<div class="outline-text-3" id="text-36-1">
<ul class="org-ul">
<li>Survey paper</li>
<li>Offers quick overview of various algorithms with accuracy and other characteristics</li>
</ul>
</div>
</div>
<div id="outline-container-org10e1318" class="outline-3">
<h3 id="org10e1318"><span class="section-number-3">36.2</span> FileName</h3>
<div class="outline-text-3" id="text-36-2">
<ul class="org-ul">
<li>LokeshKumar2019<sub>PredictionOfMultiDrugResistant.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org59c4bd6" class="outline-3">
<h3 id="org59c4bd6"><span class="section-number-3">36.3</span> Abstract</h3>
<div class="outline-text-3" id="text-36-3">
<ul class="org-ul">
<li>We review different Machine Learning Approaches to predict MDR-TB. Different
feature estimation methods, execution of distinct machine learning models also
have been explored.</li>
<li>AdaBoost ensemble algorithm gave the highest accuracy of all</li>
</ul>
</div>
</div>
<div id="outline-container-org71e9d41" class="outline-3">
<h3 id="org71e9d41"><span class="section-number-3">36.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-orgd2df039" class="outline-2">
<h2 id="orgd2df039"><span class="section-number-2">37</span> <span class="done _X_">[X]</span> Mahe2019 - A large scale evaluation of TBProfiler and Mykrobe for antibiotic resistance prediction in Mycobacterium tuberculosis</h2>
<div class="outline-text-2" id="text-37">
</div>
