TopicResearch/Mycobacterium/_Resources.org
** FileName
- Mahe2019_ALargeScaleEvaluationTBProfiler.pdf
** Abstract
** Conclusion
* [-] Marino2016 - Computational and Empirical Studies Predict Mycobacterium tuberculosis-Specific T Cells as a Biomarker for Infection Outcome
** Notes
- They conducted their own experiments

** FileName
- Marino2016_ComputationalAndEmpirical.pdf
** Abstract
- Identifying biomarkers for tuberculosis (TB) is an ongoing challenge in
  developing immuno- logical correlates of infection outcome and protection.

- To effectively predict biomarkers for infection progression in any disease,
  including TB, large amounts of experi- mental data are required to reach
  statistical power and make accurate predictions.

- Machine learning techniques were used to interrogate the experimental NHP
  datasets without identifying any potential TB biomarker. In parallel, we used
  our extensive novel NHP datasets to build and calibrate a multi-organ
  computational model that combines what is occurring at the site of infection
  (e.g., lung) at a single granuloma scale with blood level readouts that can be
  tracked in mon- keys and humans.
 
** Conclusion
* [-] Marques2019 - Pulmonary nontuberculous mycobacterial infections: presumptive diagnosis based on the international microbiological criteria adopted in the state of São Paulo, Brazil, 2011-2014
** Notes
- Survey paper for NTM
- Can be used for building up the background
** FileName
- Marques2019_PulmonaryNTMInfections.pdf
** Abstract
- The objective of the present study was to determine the frequency at which the
  various NTM species are identified among selected individuals and in potential
  cases of pulmonary nontuberculous mycobacterial infection.
** Conclusion
- Although various NTM species were identified among the individuals studied,
  those presumptively identified most frequently on the basis of the
  microbiological criteria adopted in the state of São Paulo were the ones that
  are most commonly associated with pulmonary nontuberculous mycobacterial
  infection worldwide or in specific geographic regions.
 
* [-] Meldenez2015 - On Combining Multiple-Instance Learning and Active Learning for Computer-Aided Detection of Tuberculosis
** Notes
- Image processing, radiography
** FileName
- Meldenez2015_OnCombiningMultiple.pdf
** Abstract
- The major advantage of multiple-instance learning (MIL) applied to a
  computer-aided detection (CAD) system is that it allows optimizing the latter
  with case-level labels instead of accurate lesion outlines as traditionally
  required for a supervised approach.

- As shown in previous work, a MIL-based CAD system can perform comparably to
  its supervised counterpart considering complex tasks such as chest radiograph
  scoring in tuberculosis (TB) detection. However, despite this remarkable
  achievement, the uncertainty inherent to MIL can lead to a less satisfactory
  outcome if analysis at lower levels (e.g., regions or pixels) is needed.

- To minimize the labeling effort, we develop a novel instance selection
  mechanism that exploits the MIL problem definition through one-class
  classification.
 
** Conclusion
* [-] Mikusova2016 - Learning from the past for TB drug discovery in the future
** Notes
- Involves chemistry
- Survey paper
- Can be used to build up the context for Drug-Target-Interaction
** FileName
- Mikusova2016_LearningFromThePast.pdf
** Abstract
- Tuberculosis drug discovery has shifted in recent years from a primarily
  target-based approach to one that uses phenotypic high-throughput screens.

- It is clear that we still have much to learn about the drug targets and the
  complex effects of the drugs on Mycobacterium tuberculosis.

- We propose a more integrated approach that learns from earlier drug discovery
  efforts that could help to move drug discovery forward.
 
** Conclusion
* [-] Ngo2019 - Genomic prediction of tuberculosis drug- resistance: benchmarking existing databases and prediction algorithms
** Notes
- This paper seems important but I'm unable to see how to use this in the dissertation.
** FileName
- Ngo2019_GenomicPrediction.pdf
** Abstract
- It is possible to predict whether a tuberculosis (TB) patient will fail to
  respond to specific antibiotics by sequencing the genome of the infecting
  Mycobacterium tuberculosis (Mtb) and observing whether the pathogen carries
  specific mutations at drug-resistance sites.

- Here, we evaluate the performance of four popular tools (TBProfiler, MyKrobe,
  KvarQ, PhyResSE) with 6746 isolates compiled from publicly available
  databases, and subsequently identify highly probable phenotyping errors in the
  databases by genetically predicting the drug phenotypes using all four
  software.

- Our results show that these bioinformatics tools generally perform well in
  predicting the resistance status for two key first-line agents (isoniazid,
  rifampicin), but the accuracy is lower for second-line injectables and
  fluoroquinolones.
 
