TopicResearch/Mycobacterium/_Resources.html
<div id="outline-container-org4d414dc" class="outline-3">
<h3 id="org4d414dc"><span class="section-number-3">37.1</span> Notes</h3>
<div class="outline-text-3" id="text-37-1">
<ul class="org-ul">
<li>Doesn&rsquo;t directly relate to the dissertation</li>
</ul>
</div>
</div>
<div id="outline-container-org7a953f6" class="outline-3">
<h3 id="org7a953f6"><span class="section-number-3">37.2</span> FileName</h3>
<div class="outline-text-3" id="text-37-2">
<ul class="org-ul">
<li>Mahe2019<sub>ALargeScaleEvaluationTBProfiler.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org3ed93c3" class="outline-3">
<h3 id="org3ed93c3"><span class="section-number-3">37.3</span> Abstract</h3>
</div>
<div id="outline-container-org5e89d65" class="outline-3">
<h3 id="org5e89d65"><span class="section-number-3">37.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-org6663d3e" class="outline-2">
<h2 id="org6663d3e"><span class="section-number-2">38</span> <span class="todo ___">[-]</span> Marino2016 - Computational and Empirical Studies Predict Mycobacterium tuberculosis-Specific T Cells as a Biomarker for Infection Outcome</h2>
<div class="outline-text-2" id="text-38">
</div>
<div id="outline-container-org0e24d78" class="outline-3">
<h3 id="org0e24d78"><span class="section-number-3">38.1</span> Notes</h3>
<div class="outline-text-3" id="text-38-1">
<ul class="org-ul">
<li>They conducted their own experiments</li>
</ul>
</div>
</div>

<div id="outline-container-orgcd08c7b" class="outline-3">
<h3 id="orgcd08c7b"><span class="section-number-3">38.2</span> FileName</h3>
<div class="outline-text-3" id="text-38-2">
<ul class="org-ul">
<li>Marino2016<sub>ComputationalAndEmpirical.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org064cd4e" class="outline-3">
<h3 id="org064cd4e"><span class="section-number-3">38.3</span> Abstract</h3>
<div class="outline-text-3" id="text-38-3">
<ul class="org-ul">
<li>Identifying biomarkers for tuberculosis (TB) is an ongoing challenge in
developing immuno- logical correlates of infection outcome and protection.</li>

<li>To effectively predict biomarkers for infection progression in any disease,
including TB, large amounts of experi- mental data are required to reach
statistical power and make accurate predictions.</li>

<li>Machine learning techniques were used to interrogate the experimental NHP
datasets without identifying any potential TB biomarker. In parallel, we used
our extensive novel NHP datasets to build and calibrate a multi-organ
computational model that combines what is occurring at the site of infection
(e.g., lung) at a single granuloma scale with blood level readouts that can be
tracked in mon- keys and humans.</li>
</ul>
</div>
</div>

<div id="outline-container-org01fd79a" class="outline-3">
<h3 id="org01fd79a"><span class="section-number-3">38.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-orge8d8ccf" class="outline-2">
<h2 id="orge8d8ccf"><span class="section-number-2">39</span> <span class="todo ___">[-]</span> Marques2019 - Pulmonary nontuberculous mycobacterial infections: presumptive diagnosis based on the international microbiological criteria adopted in the state of São Paulo, Brazil, 2011-2014</h2>
<div class="outline-text-2" id="text-39">
</div>
<div id="outline-container-orgd69853c" class="outline-3">
<h3 id="orgd69853c"><span class="section-number-3">39.1</span> Notes</h3>
<div class="outline-text-3" id="text-39-1">
<ul class="org-ul">
<li>Survey paper for NTM</li>
<li>Can be used for building up the background</li>
</ul>
</div>
</div>
<div id="outline-container-org1f2600f" class="outline-3">
<h3 id="org1f2600f"><span class="section-number-3">39.2</span> FileName</h3>
<div class="outline-text-3" id="text-39-2">
<ul class="org-ul">
<li>Marques2019<sub>PulmonaryNTMInfections.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org07117df" class="outline-3">
<h3 id="org07117df"><span class="section-number-3">39.3</span> Abstract</h3>
<div class="outline-text-3" id="text-39-3">
<ul class="org-ul">
<li>The objective of the present study was to determine the frequency at which the
various NTM species are identified among selected individuals and in potential
cases of pulmonary nontuberculous mycobacterial infection.</li>
</ul>
</div>
</div>
<div id="outline-container-org344e749" class="outline-3">
<h3 id="org344e749"><span class="section-number-3">39.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-39-4">
<ul class="org-ul">
<li>Although various NTM species were identified among the individuals studied,
those presumptively identified most frequently on the basis of the
microbiological criteria adopted in the state of São Paulo were the ones that
are most commonly associated with pulmonary nontuberculous mycobacterial
infection worldwide or in specific geographic regions.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org74089f1" class="outline-2">
<h2 id="org74089f1"><span class="section-number-2">40</span> <span class="todo ___">[-]</span> Meldenez2015 - On Combining Multiple-Instance Learning and Active Learning for Computer-Aided Detection of Tuberculosis</h2>
<div class="outline-text-2" id="text-40">
</div>
<div id="outline-container-orgd8008be" class="outline-3">
<h3 id="orgd8008be"><span class="section-number-3">40.1</span> Notes</h3>
<div class="outline-text-3" id="text-40-1">
<ul class="org-ul">
<li>Image processing, radiography</li>
</ul>
</div>
</div>
<div id="outline-container-org948de83" class="outline-3">
<h3 id="org948de83"><span class="section-number-3">40.2</span> FileName</h3>
<div class="outline-text-3" id="text-40-2">
<ul class="org-ul">
<li>Meldenez2015<sub>OnCombiningMultiple.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-orgf7329e5" class="outline-3">
<h3 id="orgf7329e5"><span class="section-number-3">40.3</span> Abstract</h3>
<div class="outline-text-3" id="text-40-3">
<ul class="org-ul">
<li>The major advantage of multiple-instance learning (MIL) applied to a
computer-aided detection (CAD) system is that it allows optimizing the latter
with case-level labels instead of accurate lesion outlines as traditionally
required for a supervised approach.</li>

<li>As shown in previous work, a MIL-based CAD system can perform comparably to
its supervised counterpart considering complex tasks such as chest radiograph
scoring in tuberculosis (TB) detection. However, despite this remarkable
achievement, the uncertainty inherent to MIL can lead to a less satisfactory
outcome if analysis at lower levels (e.g., regions or pixels) is needed.</li>

<li>To minimize the labeling effort, we develop a novel instance selection
mechanism that exploits the MIL problem definition through one-class
classification.</li>
</ul>
</div>
</div>

<div id="outline-container-org22427ec" class="outline-3">
<h3 id="org22427ec"><span class="section-number-3">40.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-orgf77043f" class="outline-2">
<h2 id="orgf77043f"><span class="section-number-2">41</span> <span class="todo ___">[-]</span> Mikusova2016 - Learning from the past for TB drug discovery in the future</h2>
<div class="outline-text-2" id="text-41">
</div>
<div id="outline-container-orge333a3c" class="outline-3">
<h3 id="orge333a3c"><span class="section-number-3">41.1</span> Notes</h3>
<div class="outline-text-3" id="text-41-1">
<ul class="org-ul">
<li>Involves chemistry</li>
<li>Survey paper</li>
<li>Can be used to build up the context for Drug-Target-Interaction</li>
</ul>
</div>
</div>
<div id="outline-container-org40a47f9" class="outline-3">
<h3 id="org40a47f9"><span class="section-number-3">41.2</span> FileName</h3>
<div class="outline-text-3" id="text-41-2">
<ul class="org-ul">
<li>Mikusova2016<sub>LearningFromThePast.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org8a1b246" class="outline-3">
<h3 id="org8a1b246"><span class="section-number-3">41.3</span> Abstract</h3>
<div class="outline-text-3" id="text-41-3">
<ul class="org-ul">
<li>Tuberculosis drug discovery has shifted in recent years from a primarily
target-based approach to one that uses phenotypic high-throughput screens.</li>

<li>It is clear that we still have much to learn about the drug targets and the
complex effects of the drugs on Mycobacterium tuberculosis.</li>

<li>We propose a more integrated approach that learns from earlier drug discovery
efforts that could help to move drug discovery forward.</li>
</ul>
</div>
</div>

<div id="outline-container-orga5f8d17" class="outline-3">
<h3 id="orga5f8d17"><span class="section-number-3">41.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-orgb1e74c9" class="outline-2">
<h2 id="orgb1e74c9"><span class="section-number-2">42</span> <span class="todo ___">[-]</span> Ngo2019 - Genomic prediction of tuberculosis drug- resistance: benchmarking existing databases and prediction algorithms</h2>
<div class="outline-text-2" id="text-42">
</div>
<div id="outline-container-orgb78612c" class="outline-3">
<h3 id="orgb78612c"><span class="section-number-3">42.1</span> Notes</h3>
<div class="outline-text-3" id="text-42-1">
<ul class="org-ul">
<li>This paper seems important but I&rsquo;m unable to see how to use this in the dissertation.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb4b8475" class="outline-3">
<h3 id="orgb4b8475"><span class="section-number-3">42.2</span> FileName</h3>
<div class="outline-text-3" id="text-42-2">
<ul class="org-ul">
<li>Ngo2019<sub>GenomicPrediction.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org5ec115e" class="outline-3">
<h3 id="org5ec115e"><span class="section-number-3">42.3</span> Abstract</h3>
<div class="outline-text-3" id="text-42-3">
<ul class="org-ul">
<li>It is possible to predict whether a tuberculosis (TB) patient will fail to
respond to specific antibiotics by sequencing the genome of the infecting
Mycobacterium tuberculosis (Mtb) and observing whether the pathogen carries
specific mutations at drug-resistance sites.</li>

<li>Here, we evaluate the performance of four popular tools (TBProfiler, MyKrobe,
KvarQ, PhyResSE) with 6746 isolates compiled from publicly available
databases, and subsequently identify highly probable phenotyping errors in the
databases by genetically predicting the drug phenotypes using all four
software.</li>

<li>Our results show that these bioinformatics tools generally perform well in
predicting the resistance status for two key first-line agents (isoniazid,
rifampicin), but the accuracy is lower for second-line injectables and
fluoroquinolones.</li>
</ul>
</div>
</div>
