TopicResearch/Mycobacterium/_Resources.org
** Conclusion

- The use of whole-genome sequencing to replace conventional laboratory-based
  drug-susceptibility testing reduces the time taken to culture and test against
  individual drugs, but requires sophisticated bioinformatics algorithms to be
  designed and validated to translate the genetic information into drug
  susceptibility phenotypes.

- Using latent class modeling, we have identi- fied which isolates in the
  existing databases are likely to present erroneous DST phenotypes and
  recalibrated the performance of these bioinformatics software adjusting for
  errors in the existing databases.
 
- However, we still observe low sensitivity in detecting resistance to ETO,
  PAS, PTO, and PZA.

- Without a clear understanding to the genetic biomarkers of drug resistance or
  to their pene- trance, or at least more powerful algorithms that can pick up
  additional intricacies of resistance across multiple drugs, such as what have
  been done for HIV and cancer [22–24], the ability to successfully predict the
  presence of drug-resistance is reduced.
 
* [-] Periwal2011 - Predictive models for anti-tubercular molecules using machine learning on high-throughput biological screening datasets
** Notes
- Could build upon this paper by using XgBoost and other classification
  algorithms
- They've used Weka
- Data is available
- Code is not available
- They've also relied on some closed-source software
** FileName
- Periwal2011_PredictiveModels.pdf
** Abstract
- Recent reports suggest that Mtb has been developing resistance to the widely
  used anti-tubercular drugs resulting in the emergence and spread of multi
  drug-resistant (MDR) and extensively drug-resistant (XDR) strains throughout
  the world.

- Whole organism screens on the other hand are target-agnostic and have been now
  widely employed as an alternative for lead identification but they are limited
  by the time and cost involved in running the screens for large compound
  libraries.
 
** Conclusion

- We have employed a systematic and comprehensive approach to build supervised
  classification based predictive models for anti-tubercular agents from
  publicly available bioassay datasets for in-vitro screens for Mtb inhibitors.

- We have generated classification models for anti-tubercular agents with four
  commonly used state-of-the-art classifiers i.e. Naïve Bayes, Random Forest,
  J48 and SMO
 
* [ ] Ratnatunga2020 - The Rise of Non-Tuberculosis Mycobacterial Lung Disease
** Notes
- Survey paper for NTM
- Can be used for background context
** FileName
- Ratnatunga2020_RiseOfNTMLungDisease.pdf
** Abstract
- These lesser known “cousins” of Mycobacterium tuberculosis (TB) were once
  thought to be harmless environmental saprophytics and only dangerous to
  individuals with defective lung structure or the immunosuppressed.

- NTM have become extremely antibiotic resistant, and now have been found to be
  internationally dispersed through person-to-person contact.
 
** Conclusion
* WAIT Romero2020 - Decision tree machine learning applied to bovine tuberculosis risk factors to aid disease control decision making
** Notes
- Can use other algorithms for improving the accuracy i.e. XgBoost

- Uses Decision Tree Classifier to segregate the areas into low, mid, high risk

- Code is not provided

- Ask LJMU staff for help in this
** FileName
- Romero2020_DecisionTree.pdf
** Abstract
- Identifying and understanding the risk factors for endemic bovine tuberculosis
  (TB) in cattle herds is critical for the control of this disease. Exploratory
  machine learning techniques can uncover complex non-linear relation- ships and
  interactions within disease causation webs, and enhance our knowledge of TB
  risk factors and how they are interrelated.

-  The best classification tree models informed multivariable binomial logistic
  regression models in each area, adding statistical inference outputs. These
  two approaches showed similar predictive performance although there were some
  disparities regarding what constituted high-risk predictors.

- Decision tree machine learning approaches can identify risk factors from webs
  of causation: information which may then be used to inform decision making for
  disease control purposes.
 
** Conclusion
** Supplementary
*** Romero2020_DecisionTree_Corrigendum.pdf
* DONE Sauer2018 - Feature selection and prediction of treatment failure in tuberculosis
EMILYN: Please think of project(s)
** Notes
- Code is available
  https://github.com/biosharp-dotnet/niaid_TB

- The data is sourced from dedicated NIH website
  https://tbportals.niaid.nih.gov/

- Can use XgBoost and/or H20

- Can add the data from other sources as well, perhaps Brazilian
** FileName
- Sauer2018_FeatureSelection.pdf
** Abstract
- On a multi-country dataset managed by the National Institute of Allergy and
  Infectious Diseases we applied various machine learning techniques to
  identify factors statistically associated with treatment failure and to
  predict treatment failure based on baseline demographic and clinical
  characteristics alone.
 
** Conclusion 
* [-] Schiff2018 - Clinical relevance of non-tuberculous mycobacteria isolated from respiratory specimens: seven year experience in a UK hospital
** Notes
- Survey report

- Can be used for background context
