TopicResearch/Mycobacterium/_Resources.html

<div id="outline-container-org1d32a25" class="outline-3">
<h3 id="org1d32a25"><span class="section-number-3">42.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-42-4">
<ul class="org-ul">
<li>The use of whole-genome sequencing to replace conventional laboratory-based
drug-susceptibility testing reduces the time taken to culture and test against
individual drugs, but requires sophisticated bioinformatics algorithms to be
designed and validated to translate the genetic information into drug
susceptibility phenotypes.</li>

<li>Using latent class modeling, we have identi- fied which isolates in the
existing databases are likely to present erroneous DST phenotypes and
recalibrated the performance of these bioinformatics software adjusting for
errors in the existing databases.</li>

<li>However, we still observe low sensitivity in detecting resistance to ETO,
PAS, PTO, and PZA.</li>

<li>Without a clear understanding to the genetic biomarkers of drug resistance or
to their pene- trance, or at least more powerful algorithms that can pick up
additional intricacies of resistance across multiple drugs, such as what have
been done for HIV and cancer [22–24], the ability to successfully predict the
presence of drug-resistance is reduced.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd294a50" class="outline-2">
<h2 id="orgd294a50"><span class="section-number-2">43</span> <span class="todo ___">[-]</span> Periwal2011 - Predictive models for anti-tubercular molecules using machine learning on high-throughput biological screening datasets</h2>
<div class="outline-text-2" id="text-43">
</div>
<div id="outline-container-org622b584" class="outline-3">
<h3 id="org622b584"><span class="section-number-3">43.1</span> Notes</h3>
<div class="outline-text-3" id="text-43-1">
<ul class="org-ul">
<li>Could build upon this paper by using XgBoost and other classification
algorithms</li>
<li>They&rsquo;ve used Weka</li>
<li>Data is available</li>
<li>Code is not available</li>
<li>They&rsquo;ve also relied on some closed-source software</li>
</ul>
</div>
</div>
<div id="outline-container-orgb2a1106" class="outline-3">
<h3 id="orgb2a1106"><span class="section-number-3">43.2</span> FileName</h3>
<div class="outline-text-3" id="text-43-2">
<ul class="org-ul">
<li>Periwal2011<sub>PredictiveModels.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-orgee70c69" class="outline-3">
<h3 id="orgee70c69"><span class="section-number-3">43.3</span> Abstract</h3>
<div class="outline-text-3" id="text-43-3">
<ul class="org-ul">
<li>Recent reports suggest that Mtb has been developing resistance to the widely
used anti-tubercular drugs resulting in the emergence and spread of multi
drug-resistant (MDR) and extensively drug-resistant (XDR) strains throughout
the world.</li>

<li>Whole organism screens on the other hand are target-agnostic and have been now
widely employed as an alternative for lead identification but they are limited
by the time and cost involved in running the screens for large compound
libraries.</li>
</ul>
</div>
</div>

<div id="outline-container-org786a841" class="outline-3">
<h3 id="org786a841"><span class="section-number-3">43.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-43-4">
<ul class="org-ul">
<li>We have employed a systematic and comprehensive approach to build supervised
classification based predictive models for anti-tubercular agents from
publicly available bioassay datasets for in-vitro screens for Mtb inhibitors.</li>

<li>We have generated classification models for anti-tubercular agents with four
commonly used state-of-the-art classifiers i.e. Naïve Bayes, Random Forest,
J48 and SMO</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgeaf56b4" class="outline-2">
<h2 id="orgeaf56b4"><span class="section-number-2">44</span> <span class="todo ___">[ ]</span> Ratnatunga2020 - The Rise of Non-Tuberculosis Mycobacterial Lung Disease</h2>
<div class="outline-text-2" id="text-44">
</div>
<div id="outline-container-org44d632f" class="outline-3">
<h3 id="org44d632f"><span class="section-number-3">44.1</span> Notes</h3>
<div class="outline-text-3" id="text-44-1">
<ul class="org-ul">
<li>Survey paper for NTM</li>
<li>Can be used for background context</li>
</ul>
</div>
</div>
<div id="outline-container-org7e0c5ba" class="outline-3">
<h3 id="org7e0c5ba"><span class="section-number-3">44.2</span> FileName</h3>
<div class="outline-text-3" id="text-44-2">
<ul class="org-ul">
<li>Ratnatunga2020<sub>RiseOfNTMLungDisease.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-orge9372ae" class="outline-3">
<h3 id="orge9372ae"><span class="section-number-3">44.3</span> Abstract</h3>
<div class="outline-text-3" id="text-44-3">
<ul class="org-ul">
<li>These lesser known “cousins” of Mycobacterium tuberculosis (TB) were once
thought to be harmless environmental saprophytics and only dangerous to
individuals with defective lung structure or the immunosuppressed.</li>

<li>NTM have become extremely antibiotic resistant, and now have been found to be
internationally dispersed through person-to-person contact.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd8c691d" class="outline-3">
<h3 id="orgd8c691d"><span class="section-number-3">44.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-orga687d85" class="outline-2">
<h2 id="orga687d85"><span class="section-number-2">45</span> <span class="todo WAIT">WAIT</span> Romero2020 - Decision tree machine learning applied to bovine tuberculosis risk factors to aid disease control decision making</h2>
<div class="outline-text-2" id="text-45">
</div>
<div id="outline-container-org81825b2" class="outline-3">
<h3 id="org81825b2"><span class="section-number-3">45.1</span> Notes</h3>
<div class="outline-text-3" id="text-45-1">
<ul class="org-ul">
<li>Can use other algorithms for improving the accuracy i.e. XgBoost</li>

<li>Uses Decision Tree Classifier to segregate the areas into low, mid, high risk</li>

<li>Code is not provided</li>

<li>Ask LJMU staff for help in this</li>
</ul>
</div>
</div>
<div id="outline-container-orgf4a62e1" class="outline-3">
<h3 id="orgf4a62e1"><span class="section-number-3">45.2</span> FileName</h3>
<div class="outline-text-3" id="text-45-2">
<ul class="org-ul">
<li>Romero2020<sub>DecisionTree.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-orgc58b5a1" class="outline-3">
<h3 id="orgc58b5a1"><span class="section-number-3">45.3</span> Abstract</h3>
<div class="outline-text-3" id="text-45-3">
<ul class="org-ul">
<li>Identifying and understanding the risk factors for endemic bovine tuberculosis
(TB) in cattle herds is critical for the control of this disease. Exploratory
machine learning techniques can uncover complex non-linear relation- ships and
interactions within disease causation webs, and enhance our knowledge of TB
risk factors and how they are interrelated.</li>

<li>The best classification tree models informed multivariable binomial logistic
regression models in each area, adding statistical inference outputs. These
two approaches showed similar predictive performance although there were some
disparities regarding what constituted high-risk predictors.</li>

<li>Decision tree machine learning approaches can identify risk factors from webs
of causation: information which may then be used to inform decision making for
disease control purposes.</li>
</ul>
</div>
</div>

<div id="outline-container-org32c76ad" class="outline-3">
<h3 id="org32c76ad"><span class="section-number-3">45.4</span> Conclusion</h3>
</div>
<div id="outline-container-org20cdb11" class="outline-3">
<h3 id="org20cdb11"><span class="section-number-3">45.5</span> Supplementary</h3>
<div class="outline-text-3" id="text-45-5">
</div>
<div id="outline-container-org93362d7" class="outline-4">
<h4 id="org93362d7"><span class="section-number-4">45.5.1</span> Romero2020<sub>DecisionTree</sub><sub>Corrigendum.pdf</sub></h4>
</div>
</div>
</div>
<div id="outline-container-org9f971cb" class="outline-2">
<h2 id="org9f971cb"><span class="section-number-2">46</span> <span class="done DONE">DONE</span> Sauer2018 - Feature selection and prediction of treatment failure in tuberculosis</h2>
<div class="outline-text-2" id="text-46">
<p>
EMILYN: Please think of project(s)
</p>
</div>
<div id="outline-container-orgdd9ad5d" class="outline-3">
<h3 id="orgdd9ad5d"><span class="section-number-3">46.1</span> Notes</h3>
<div class="outline-text-3" id="text-46-1">
<ul class="org-ul">
<li>Code is available
<a href="https://github.com/biosharp-dotnet/niaid_TB">https://github.com/biosharp-dotnet/niaid_TB</a></li>

<li>The data is sourced from dedicated NIH website
<a href="https://tbportals.niaid.nih.gov/">https://tbportals.niaid.nih.gov/</a></li>

<li>Can use XgBoost and/or H20</li>

<li>Can add the data from other sources as well, perhaps Brazilian</li>
</ul>
</div>
</div>
<div id="outline-container-org5cdbcc3" class="outline-3">
<h3 id="org5cdbcc3"><span class="section-number-3">46.2</span> FileName</h3>
<div class="outline-text-3" id="text-46-2">
<ul class="org-ul">
<li>Sauer2018<sub>FeatureSelection.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org53a2297" class="outline-3">
<h3 id="org53a2297"><span class="section-number-3">46.3</span> Abstract</h3>
<div class="outline-text-3" id="text-46-3">
<ul class="org-ul">
<li>On a multi-country dataset managed by the National Institute of Allergy and
Infectious Diseases we applied various machine learning techniques to
identify factors statistically associated with treatment failure and to
predict treatment failure based on baseline demographic and clinical
characteristics alone.</li>
</ul>
</div>
</div>

<div id="outline-container-orga2b155c" class="outline-3">
<h3 id="orga2b155c"><span class="section-number-3">46.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-org062b295" class="outline-2">
<h2 id="org062b295"><span class="section-number-2">47</span> <span class="todo ___">[-]</span> Schiff2018 - Clinical relevance of non-tuberculous mycobacteria isolated from respiratory specimens: seven year experience in a UK hospital</h2>
<div class="outline-text-2" id="text-47">
</div>
