TopicResearch/Mycobacterium/_Resources.org
** FileName
- Schiff2018_ClinicalRelevanceOfNTM.pdf
** Abstract
** Conclusion
* WAIT Sergeev2016 - Genome-wide Analysis of MDR and XDR Tuberculosis from Belarus: Machine-learning Approach
** Notes
- Uses XgBoost XGB classifier

- Can apply this approach for NTM

- Involves mathematical equations

- I've contacted the authors for the code
** FileName
- Sergeev2016_GenomeWide.pdf
** Abstract
- Alterations in pathogen genomes are among the main mechanisms by which
  microorganisms exhibit drug resistance.

- Analysis of 144 M. tuberculosis strains of different phenotypes including drug
  susceptible, MDR and XDR isolated in Belarus was fulfilled in this paper. A
  wide range of machine learning methods that can discover SNPs related to
  drug-resistance in the whole bacteria genomes was investigated

- Besides single-SNP testing approaches, methods that allow detecting joint
  effects from interacting SNPs were considered.

- Analysis of whole-genome sequences often leads to situations where the number
  of treated features exceeds the number of available observations. For this
  reason, special attention is paid to fair evaluation of the model prediction
  quality and minimizing the risk of overfitting while estimating the underlying
  parameters.

 
** Conclusion
* [-] Vizcaino2010 - Computational Prediction and Experimental Assessment of Secreted/Surface Proteins from Mycobacterium tuberculosis H37Rv
** Notes
- I suspect, this involves some work in the wetlab

- Might be interesting for Emilyn as it involves quite a lot of biological
  knowledge as well

- Has many microscopic photos of the bacteria
** FileName
- Vizcaino2010_ComputatationalPrediction.pdf
** Abstract
- The mycobacterial cell envelope has been implicated in the pathogenicity of
  tuberculosis and therefore has been a prime target for the identification and
  characterization of surface proteins with potential application in drug and
  vaccine development.

- In this study, the genome of Mycobacterium tuberculosis
  H37Rv was screened using Machine Learning tools that included feature-based
  predictors, general localizers and transmembrane topology predictors to
  identify proteins that are potentially secreted to the surface of M.
  tuberculosis, or to the extracellular milieu through different secretory
  pathways.

- Surface localization was also confirmed for the positive controls, whereas
  negative controls were located on the cytoplasm. Based on statistical learning
  methods, we obtained computational subcellular localization predictions that
  were experimentally assessed and allowed us to construct a computational
  protocol with experimental support that allowed us to identify a new set of
  secreted/surface proteins as potential vaccine candidates.

** Conclusion
* [-] Waman2019 - Mycobacterial genomics and structural bioinformatics: opportunities and challenges in drug discovery
** Notes
- Survey paper, can be used for background context
** FileName
- Waman2019_MycobacterialGenomics.pdf
** Abstract
- Here we describe the impact of the rapid expansion of genome sequencing and
  genome/pathway annotations that have greatly improved the progress of
  structure-guided drug discovery.

- We focus on the applications of comparative genomics, metabolomics,
  evolutionary bioinformatics and structural proteomics to identify potential
  drug targets. The opportunities and challenges for the design of drugs for M.
  tuberculosis, M. leprae and M. abscessus to combat resistance are discussed.
 
** Conclusion
* [?] Wang2020 - A deep learning-based method for drug-target interaction prediction based on long short-term memory neural network
** Notes

- Doesn't directly relate to MTB or NTM, but could be used as a reference in
  future work
 
- Builds up the mathematical reasoning wrt bio-chemistry

- Explains the techniques well

- Data and code is available
https://deepbiolab.coding.net/s/fbdb894d-2730-425b-bac6-18ba55396bab
** FileName
- Wang2020_ADeepLearningBasedMethod.pdf
** Abstract
- Due to the influence of throughput, precision and cost, traditional
  experimental methods are difficult to be widely used to infer these potential
  Drug-Target Interactions (DTIs). Therefore, it is urgent to develop effective
  computational methods to validate the interaction between drugs and target.
 
** Conclusion

- We have developed a deep learning-based method to infer potential DTIs using
  compounds and proteins sequence.

- Comparing with other classifiers, we have provided initial evidence that
  DeepLSTM outperforms traditional ma- chine learning system on the DTIs task.


** Supplementary
- Wang2020_ADeepLearningBasedMethod_Code.py
- Wang2020_ADeepLearningBasedMethod_Supplementary.pdf
* [?] Weiner2017 - High-throughput and computational approaches for diagnostic and prognostic host tuberculosis biomarkers
** Notes
- Survey paper
 
** FileName
- Weiner2017_HighThroughput.pdf
