TopicResearch/Mycobacterium/_Resources.html
<div id="outline-container-org16aa2f8" class="outline-3">
<h3 id="org16aa2f8"><span class="section-number-3">47.1</span> Notes</h3>
<div class="outline-text-3" id="text-47-1">
<ul class="org-ul">
<li>Survey report</li>

<li>Can be used for background context</li>
</ul>
</div>
</div>
<div id="outline-container-orge8b7ca0" class="outline-3">
<h3 id="orge8b7ca0"><span class="section-number-3">47.2</span> FileName</h3>
<div class="outline-text-3" id="text-47-2">
<ul class="org-ul">
<li>Schiff2018<sub>ClinicalRelevanceOfNTM.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org29ec187" class="outline-3">
<h3 id="org29ec187"><span class="section-number-3">47.3</span> Abstract</h3>
</div>
<div id="outline-container-org17178fd" class="outline-3">
<h3 id="org17178fd"><span class="section-number-3">47.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-org2649eee" class="outline-2">
<h2 id="org2649eee"><span class="section-number-2">48</span> <span class="todo WAIT">WAIT</span> Sergeev2016 - Genome-wide Analysis of MDR and XDR Tuberculosis from Belarus: Machine-learning Approach</h2>
<div class="outline-text-2" id="text-48">
</div>
<div id="outline-container-orgce785ce" class="outline-3">
<h3 id="orgce785ce"><span class="section-number-3">48.1</span> Notes</h3>
<div class="outline-text-3" id="text-48-1">
<ul class="org-ul">
<li>Uses XgBoost XGB classifier</li>

<li>Can apply this approach for NTM</li>

<li>Involves mathematical equations</li>

<li>I&rsquo;ve contacted the authors for the code</li>
</ul>
</div>
</div>
<div id="outline-container-org6202544" class="outline-3">
<h3 id="org6202544"><span class="section-number-3">48.2</span> FileName</h3>
<div class="outline-text-3" id="text-48-2">
<ul class="org-ul">
<li>Sergeev2016<sub>GenomeWide.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org8855cd8" class="outline-3">
<h3 id="org8855cd8"><span class="section-number-3">48.3</span> Abstract</h3>
<div class="outline-text-3" id="text-48-3">
<ul class="org-ul">
<li>Alterations in pathogen genomes are among the main mechanisms by which
microorganisms exhibit drug resistance.</li>

<li>Analysis of 144 M. tuberculosis strains of different phenotypes including drug
susceptible, MDR and XDR isolated in Belarus was fulfilled in this paper. A
wide range of machine learning methods that can discover SNPs related to
drug-resistance in the whole bacteria genomes was investigated</li>

<li>Besides single-SNP testing approaches, methods that allow detecting joint
effects from interacting SNPs were considered.</li>

<li>Analysis of whole-genome sequences often leads to situations where the number
of treated features exceeds the number of available observations. For this
reason, special attention is paid to fair evaluation of the model prediction
quality and minimizing the risk of overfitting while estimating the underlying
parameters.</li>
</ul>
</div>
</div>


<div id="outline-container-org1a3f55d" class="outline-3">
<h3 id="org1a3f55d"><span class="section-number-3">48.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-org5508a5a" class="outline-2">
<h2 id="org5508a5a"><span class="section-number-2">49</span> <span class="todo ___">[-]</span> Vizcaino2010 - Computational Prediction and Experimental Assessment of Secreted/Surface Proteins from Mycobacterium tuberculosis H37Rv</h2>
<div class="outline-text-2" id="text-49">
</div>
<div id="outline-container-org3898256" class="outline-3">
<h3 id="org3898256"><span class="section-number-3">49.1</span> Notes</h3>
<div class="outline-text-3" id="text-49-1">
<ul class="org-ul">
<li>I suspect, this involves some work in the wetlab</li>

<li>Might be interesting for Emilyn as it involves quite a lot of biological
knowledge as well</li>

<li>Has many microscopic photos of the bacteria</li>
</ul>
</div>
</div>
<div id="outline-container-orgb77fa24" class="outline-3">
<h3 id="orgb77fa24"><span class="section-number-3">49.2</span> FileName</h3>
<div class="outline-text-3" id="text-49-2">
<ul class="org-ul">
<li>Vizcaino2010<sub>ComputatationalPrediction.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org81f28a2" class="outline-3">
<h3 id="org81f28a2"><span class="section-number-3">49.3</span> Abstract</h3>
<div class="outline-text-3" id="text-49-3">
<ul class="org-ul">
<li>The mycobacterial cell envelope has been implicated in the pathogenicity of
tuberculosis and therefore has been a prime target for the identification and
characterization of surface proteins with potential application in drug and
vaccine development.</li>

<li>In this study, the genome of Mycobacterium tuberculosis
H37Rv was screened using Machine Learning tools that included feature-based
predictors, general localizers and transmembrane topology predictors to
identify proteins that are potentially secreted to the surface of M.
tuberculosis, or to the extracellular milieu through different secretory
pathways.</li>

<li>Surface localization was also confirmed for the positive controls, whereas
negative controls were located on the cytoplasm. Based on statistical learning
methods, we obtained computational subcellular localization predictions that
were experimentally assessed and allowed us to construct a computational
protocol with experimental support that allowed us to identify a new set of
secreted/surface proteins as potential vaccine candidates.</li>
</ul>
</div>
</div>

<div id="outline-container-org227a48e" class="outline-3">
<h3 id="org227a48e"><span class="section-number-3">49.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-org709bfe6" class="outline-2">
<h2 id="org709bfe6"><span class="section-number-2">50</span> <span class="todo ___">[-]</span> Waman2019 - Mycobacterial genomics and structural bioinformatics: opportunities and challenges in drug discovery</h2>
<div class="outline-text-2" id="text-50">
</div>
<div id="outline-container-org3694c31" class="outline-3">
<h3 id="org3694c31"><span class="section-number-3">50.1</span> Notes</h3>
<div class="outline-text-3" id="text-50-1">
<ul class="org-ul">
<li>Survey paper, can be used for background context</li>
</ul>
</div>
</div>
<div id="outline-container-orga2ce9f6" class="outline-3">
<h3 id="orga2ce9f6"><span class="section-number-3">50.2</span> FileName</h3>
<div class="outline-text-3" id="text-50-2">
<ul class="org-ul">
<li>Waman2019<sub>MycobacterialGenomics.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org00b7acf" class="outline-3">
<h3 id="org00b7acf"><span class="section-number-3">50.3</span> Abstract</h3>
<div class="outline-text-3" id="text-50-3">
<ul class="org-ul">
<li>Here we describe the impact of the rapid expansion of genome sequencing and
genome/pathway annotations that have greatly improved the progress of
structure-guided drug discovery.</li>

<li>We focus on the applications of comparative genomics, metabolomics,
evolutionary bioinformatics and structural proteomics to identify potential
drug targets. The opportunities and challenges for the design of drugs for M.
tuberculosis, M. leprae and M. abscessus to combat resistance are discussed.</li>
</ul>
</div>
</div>

<div id="outline-container-org757c3c5" class="outline-3">
<h3 id="org757c3c5"><span class="section-number-3">50.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-org73e95c0" class="outline-2">
<h2 id="org73e95c0"><span class="section-number-2">51</span> <span class="todo ___">[?]</span> Wang2020 - A deep learning-based method for drug-target interaction prediction based on long short-term memory neural network</h2>
<div class="outline-text-2" id="text-51">
</div>
<div id="outline-container-orgda3edf0" class="outline-3">
<h3 id="orgda3edf0"><span class="section-number-3">51.1</span> Notes</h3>
<div class="outline-text-3" id="text-51-1">
<ul class="org-ul">
<li>Doesn&rsquo;t directly relate to MTB or NTM, but could be used as a reference in
future work</li>

<li>Builds up the mathematical reasoning wrt bio-chemistry</li>

<li>Explains the techniques well</li>

<li>Data and code is available</li>
</ul>
<p>
<a href="https://deepbiolab.coding.net/s/fbdb894d-2730-425b-bac6-18ba55396bab">https://deepbiolab.coding.net/s/fbdb894d-2730-425b-bac6-18ba55396bab</a>
</p>
</div>
</div>
<div id="outline-container-org63e13ba" class="outline-3">
<h3 id="org63e13ba"><span class="section-number-3">51.2</span> FileName</h3>
<div class="outline-text-3" id="text-51-2">
<ul class="org-ul">
<li>Wang2020<sub>ADeepLearningBasedMethod.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-orgff382d7" class="outline-3">
<h3 id="orgff382d7"><span class="section-number-3">51.3</span> Abstract</h3>
<div class="outline-text-3" id="text-51-3">
<ul class="org-ul">
<li>Due to the influence of throughput, precision and cost, traditional
experimental methods are difficult to be widely used to infer these potential
Drug-Target Interactions (DTIs). Therefore, it is urgent to develop effective
computational methods to validate the interaction between drugs and target.</li>
</ul>
</div>
</div>

<div id="outline-container-org2703fae" class="outline-3">
<h3 id="org2703fae"><span class="section-number-3">51.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-51-4">
<ul class="org-ul">
<li>We have developed a deep learning-based method to infer potential DTIs using
compounds and proteins sequence.</li>

<li>Comparing with other classifiers, we have provided initial evidence that
DeepLSTM outperforms traditional ma- chine learning system on the DTIs task.</li>
</ul>
</div>
</div>


<div id="outline-container-orgf3774ef" class="outline-3">
<h3 id="orgf3774ef"><span class="section-number-3">51.5</span> Supplementary</h3>
<div class="outline-text-3" id="text-51-5">
<ul class="org-ul">
<li>Wang2020<sub>ADeepLearningBasedMethod</sub><sub>Code.py</sub></li>
<li>Wang2020<sub>ADeepLearningBasedMethod</sub><sub>Supplementary.pdf</sub></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge662795" class="outline-2">
<h2 id="orge662795"><span class="section-number-2">52</span> <span class="todo ___">[?]</span> Weiner2017 - High-throughput and computational approaches for diagnostic and prognostic host tuberculosis biomarkers</h2>
<div class="outline-text-2" id="text-52">
</div>
<div id="outline-container-org656acf5" class="outline-3">
<h3 id="org656acf5"><span class="section-number-3">52.1</span> Notes</h3>
<div class="outline-text-3" id="text-52-1">
<ul class="org-ul">
<li>Survey paper</li>
</ul>
</div>
</div>

<div id="outline-container-orgf2ebcd2" class="outline-3">
<h3 id="orgf2ebcd2"><span class="section-number-3">52.2</span> FileName</h3>
<div class="outline-text-3" id="text-52-2">
<ul class="org-ul">
<li>Weiner2017<sub>HighThroughput.pdf</sub></li>
</ul>
</div>
</div>
