TopicResearch/Mycobacterium/_Resources.org
** Abstract
- High-throughput techniques strive to identify new biomarkers that will be
  useful for the diagnosis, treatment, and prevention of tuberculosis (TB).
  However, their analysis and interpretation pose considerable challenges.

- Recent developments in the high-throughput detection of host biomarkers in TB
  are reported in this review.
 
** Conclusion
* WAIT Wilder2019 - Improving tuberculosis treatment by integrating optimization and learning
** FileName
- Wilder2019_ImprovingTuberculosis.pdf
** Notes

- Mentions https://www.99dots.org/ for strategic intervention

- Emailed the 99dots team for some data access
** Abstract
- The prevalence of TB is caused in part by non-adherence to medication, which
  results in greater risk of death, reinfection and contraction of
  multidrug-resistant TB

- Using data on 17,000 Indian patients provided by the NGO Everwell, we consider
  the problem of predicting which patients are likely to miss doses in the
  near future and optimizing interventions by health workers to avert such
  treatment failures.
 
** Conclusion
* DONE Yang2017 - Machine learning for classifying tuberculosis drug-resistance from DNA sequencing data
EMILYN: We could have a project proposal, which compares the various attempts in
the field and perhaps include new data and algorithms.
** Notes
- Code is available and already downloaded

- Builds upon a previous publication Walker2015 for narrowing the feature set.

- The data is the same as used in Walker2015, 1839 samples
 
** FileName
- Yang2017_MachineLearning.pdf
 
** Abstract
- Given the availability of DNA sequencing data from MTB, we developed machine
  learning models for a cohort of 1839 UK bacterial isolates to classify MTB
  resistance against eight anti- TB drugs (isoniazid, rifampicin, ethambutol,
  pyrazinamide, ciprofloxacin, moxifloxacin, ofloxacin, streptomycin) and to
  classify multi-drug resistance.

** Conclusion
- We performed both principal component analysis (PCA) and a sparse logistic
  version (SL-PCA) to explore the underlying structure of genetic variation
  within our cohort of bacterial isolates.

- Among the machine learning classifiers, PM and SVM-RBF rank as the top two
  best-performing classifiers overall. The former integrates prior knowledge of
  resistance determinant explicitly (though prior knowledge about susceptibility
  determinants, lineage defining SNPs and compensatory mutations was not
  included), and the latter suggests that the method’s nonlinear model is
  suitable for unveiling nonlinear rela- tionships among mutations in terms of
  resistance association for INH, CIP and SM.

- This work showed great potentials of machine learning in improving resistance
  classification given high-dimensional genetic data, especially when the
  underlying biological resistance mecha- nism is poorly understood for many
  drugs
 
** Supplementary
- Yang2017_MachineLearning_Code.zip
- Yang2017_MachineLearning_Supplement.pdf
- Yang2017_MachineLearning_Walker2015_BasePaper.pdf
* DONE Yang2019 - DeepAMR for predicting co-occurrent resistance of Mycobacterium tuberculosis
** Notes
- Code is available and already downloaded

- Paper also references
  https://github.com/biosharp-dotnet/Keras_Deep_Clustering

- Makes use of Multi-label K-nearest neighbour (MLKNN)
** FileName
- Yang2019_DeepAMRForPredicting_Code.pdf
** Abstract
- Existing methods based on genetic data analysis of Mycobacterium tuberculosis
  (MTB) have been able to predict resistance of MTB to individual drugs, but
  have not considered the resistance co-occurrence and cannot capture latent
  structure of genomic data that corresponds to lineages.

- We then proposed an end-to-end multi-task model with deep denoising
  auto-encoder (DeepAMR) for multiple drug classification and developed
  DeepAMR_cluster, a clustering variant based on DeepAMR, for learning clusters
  in latent space of the data.
 
** Conclusion
- The resistance prediction for the MTB is essentially a multi-label learn- ing
  problem, where each isolate is resistant to a subset of the examined drugs.
  The input is mutations for individual isolates, such that the pres- ence of a
  SNP variable is denoted as one and zero otherwise

- We only considered cross-resistance between four first-line drugs but ignored
  that of second-line drugs because: (i) the inaccurate phenotyping for
  second-line drugs would introduce large error in the classification for
  first-line drugs and (ii) a small number of resistant isolates would result in
  over-fitting easily for such a complex model.
 
** Supplementary
- Yang2019_DeepAMRForPredicting_Code.zip
- Yang2019_DeepAMRForPredicting_Supplementary.zip
* [?] Zhang2020 - An integrated machine learning approach for predicting DosR-regulated genes in Mycobacterium tuberculosis
** Notes
- Involves some background knowledge of Genomics

- The papar has mathematical rigor
** FileName
- Zhang2020_AnIntegratedMLApproach.pdf
