TopicResearch/Mycobacterium/_Resources.html
<div id="outline-container-org98880f6" class="outline-3">
<h3 id="org98880f6"><span class="section-number-3">52.3</span> Abstract</h3>
<div class="outline-text-3" id="text-52-3">
<ul class="org-ul">
<li>High-throughput techniques strive to identify new biomarkers that will be
useful for the diagnosis, treatment, and prevention of tuberculosis (TB).
However, their analysis and interpretation pose considerable challenges.</li>

<li>Recent developments in the high-throughput detection of host biomarkers in TB
are reported in this review.</li>
</ul>
</div>
</div>

<div id="outline-container-org833402f" class="outline-3">
<h3 id="org833402f"><span class="section-number-3">52.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-orgefd6324" class="outline-2">
<h2 id="orgefd6324"><span class="section-number-2">53</span> <span class="todo WAIT">WAIT</span> Wilder2019 - Improving tuberculosis treatment by integrating optimization and learning</h2>
<div class="outline-text-2" id="text-53">
</div>
<div id="outline-container-org6973ad5" class="outline-3">
<h3 id="org6973ad5"><span class="section-number-3">53.1</span> FileName</h3>
<div class="outline-text-3" id="text-53-1">
<ul class="org-ul">
<li>Wilder2019<sub>ImprovingTuberculosis.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org8eadce3" class="outline-3">
<h3 id="org8eadce3"><span class="section-number-3">53.2</span> Notes</h3>
<div class="outline-text-3" id="text-53-2">
<ul class="org-ul">
<li>Mentions <a href="https://www.99dots.org/">https://www.99dots.org/</a> for strategic intervention</li>

<li>Emailed the 99dots team for some data access</li>
</ul>
</div>
</div>
<div id="outline-container-org9f7b559" class="outline-3">
<h3 id="org9f7b559"><span class="section-number-3">53.3</span> Abstract</h3>
<div class="outline-text-3" id="text-53-3">
<ul class="org-ul">
<li>The prevalence of TB is caused in part by non-adherence to medication, which
results in greater risk of death, reinfection and contraction of
multidrug-resistant TB</li>

<li>Using data on 17,000 Indian patients provided by the NGO Everwell, we consider
the problem of predicting which patients are likely to miss doses in the
near future and optimizing interventions by health workers to avert such
treatment failures.</li>
</ul>
</div>
</div>

<div id="outline-container-org7902c74" class="outline-3">
<h3 id="org7902c74"><span class="section-number-3">53.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-org1556e3b" class="outline-2">
<h2 id="org1556e3b"><span class="section-number-2">54</span> <span class="done DONE">DONE</span> Yang2017 - Machine learning for classifying tuberculosis drug-resistance from DNA sequencing data</h2>
<div class="outline-text-2" id="text-54">
<p>
EMILYN: We could have a project proposal, which compares the various attempts in
the field and perhaps include new data and algorithms.
</p>
</div>
<div id="outline-container-orgefbcefe" class="outline-3">
<h3 id="orgefbcefe"><span class="section-number-3">54.1</span> Notes</h3>
<div class="outline-text-3" id="text-54-1">
<ul class="org-ul">
<li>Code is available and already downloaded</li>

<li>Builds upon a previous publication Walker2015 for narrowing the feature set.</li>

<li>The data is the same as used in Walker2015, 1839 samples</li>
</ul>
</div>
</div>

<div id="outline-container-org2fd7808" class="outline-3">
<h3 id="org2fd7808"><span class="section-number-3">54.2</span> FileName</h3>
<div class="outline-text-3" id="text-54-2">
<ul class="org-ul">
<li>Yang2017<sub>MachineLearning.pdf</sub></li>
</ul>
</div>
</div>

<div id="outline-container-org0fc008a" class="outline-3">
<h3 id="org0fc008a"><span class="section-number-3">54.3</span> Abstract</h3>
<div class="outline-text-3" id="text-54-3">
<ul class="org-ul">
<li>Given the availability of DNA sequencing data from MTB, we developed machine
learning models for a cohort of 1839 UK bacterial isolates to classify MTB
resistance against eight anti- TB drugs (isoniazid, rifampicin, ethambutol,
pyrazinamide, ciprofloxacin, moxifloxacin, ofloxacin, streptomycin) and to
classify multi-drug resistance.</li>
</ul>
</div>
</div>

<div id="outline-container-org6087ded" class="outline-3">
<h3 id="org6087ded"><span class="section-number-3">54.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-54-4">
<ul class="org-ul">
<li>We performed both principal component analysis (PCA) and a sparse logistic
version (SL-PCA) to explore the underlying structure of genetic variation
within our cohort of bacterial isolates.</li>

<li>Among the machine learning classifiers, PM and SVM-RBF rank as the top two
best-performing classifiers overall. The former integrates prior knowledge of
resistance determinant explicitly (though prior knowledge about susceptibility
determinants, lineage defining SNPs and compensatory mutations was not
included), and the latter suggests that the method’s nonlinear model is
suitable for unveiling nonlinear rela- tionships among mutations in terms of
resistance association for INH, CIP and SM.</li>

<li>This work showed great potentials of machine learning in improving resistance
classification given high-dimensional genetic data, especially when the
underlying biological resistance mecha- nism is poorly understood for many
drugs</li>
</ul>
</div>
</div>

<div id="outline-container-org511e792" class="outline-3">
<h3 id="org511e792"><span class="section-number-3">54.5</span> Supplementary</h3>
<div class="outline-text-3" id="text-54-5">
<ul class="org-ul">
<li>Yang2017<sub>MachineLearning</sub><sub>Code.zip</sub></li>
<li>Yang2017<sub>MachineLearning</sub><sub>Supplement.pdf</sub></li>
<li>Yang2017<sub>MachineLearning</sub><sub>Walker2015</sub><sub>BasePaper.pdf</sub></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd140b58" class="outline-2">
<h2 id="orgd140b58"><span class="section-number-2">55</span> <span class="done DONE">DONE</span> Yang2019 - DeepAMR for predicting co-occurrent resistance of Mycobacterium tuberculosis</h2>
<div class="outline-text-2" id="text-55">
</div>
<div id="outline-container-orgd323000" class="outline-3">
<h3 id="orgd323000"><span class="section-number-3">55.1</span> Notes</h3>
<div class="outline-text-3" id="text-55-1">
<ul class="org-ul">
<li>Code is available and already downloaded</li>

<li>Paper also references
<a href="https://github.com/biosharp-dotnet/Keras_Deep_Clustering">https://github.com/biosharp-dotnet/Keras_Deep_Clustering</a></li>

<li>Makes use of Multi-label K-nearest neighbour (MLKNN)</li>
</ul>
</div>
</div>
<div id="outline-container-org2c3345b" class="outline-3">
<h3 id="org2c3345b"><span class="section-number-3">55.2</span> FileName</h3>
<div class="outline-text-3" id="text-55-2">
<ul class="org-ul">
<li>Yang2019<sub>DeepAMRForPredicting</sub><sub>Code.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org734aa38" class="outline-3">
<h3 id="org734aa38"><span class="section-number-3">55.3</span> Abstract</h3>
<div class="outline-text-3" id="text-55-3">
<ul class="org-ul">
<li>Existing methods based on genetic data analysis of Mycobacterium tuberculosis
(MTB) have been able to predict resistance of MTB to individual drugs, but
have not considered the resistance co-occurrence and cannot capture latent
structure of genomic data that corresponds to lineages.</li>

<li>We then proposed an end-to-end multi-task model with deep denoising
auto-encoder (DeepAMR) for multiple drug classification and developed
DeepAMR<sub>cluster</sub>, a clustering variant based on DeepAMR, for learning clusters
in latent space of the data.</li>
</ul>
</div>
</div>

<div id="outline-container-orgdd3dd6e" class="outline-3">
<h3 id="orgdd3dd6e"><span class="section-number-3">55.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-55-4">
<ul class="org-ul">
<li>The resistance prediction for the MTB is essentially a multi-label learn- ing
problem, where each isolate is resistant to a subset of the examined drugs.
The input is mutations for individual isolates, such that the pres- ence of a
SNP variable is denoted as one and zero otherwise</li>

<li>We only considered cross-resistance between four first-line drugs but ignored
that of second-line drugs because: (i) the inaccurate phenotyping for
second-line drugs would introduce large error in the classification for
first-line drugs and (ii) a small number of resistant isolates would result in
over-fitting easily for such a complex model.</li>
</ul>
</div>
</div>

<div id="outline-container-org28f98bb" class="outline-3">
<h3 id="org28f98bb"><span class="section-number-3">55.5</span> Supplementary</h3>
<div class="outline-text-3" id="text-55-5">
<ul class="org-ul">
<li>Yang2019<sub>DeepAMRForPredicting</sub><sub>Code.zip</sub></li>
<li>Yang2019<sub>DeepAMRForPredicting</sub><sub>Supplementary.zip</sub></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga442335" class="outline-2">
<h2 id="orga442335"><span class="section-number-2">56</span> <span class="todo ___">[?]</span> Zhang2020 - An integrated machine learning approach for predicting DosR-regulated genes in Mycobacterium tuberculosis</h2>
<div class="outline-text-2" id="text-56">
</div>
<div id="outline-container-org0adf093" class="outline-3">
<h3 id="org0adf093"><span class="section-number-3">56.1</span> Notes</h3>
<div class="outline-text-3" id="text-56-1">
<ul class="org-ul">
<li>Involves some background knowledge of Genomics</li>

<li>The papar has mathematical rigor</li>
</ul>
</div>
</div>
<div id="outline-container-orgff85635" class="outline-3">
<h3 id="orgff85635"><span class="section-number-3">56.2</span> FileName</h3>
<div class="outline-text-3" id="text-56-2">
<ul class="org-ul">
<li>Zhang2020<sub>AnIntegratedMLApproach.pdf</sub></li>
</ul>
</div>
</div>
