TopicResearch/Mycobacterium/_Resources.org
** Abstract
- DosR is an important regulator of the response to stress such as limited
  oxygen availability in Mycobacterium tuberculosis

- Most of the approaches capture only a first-order approximation to the complex
  transcriptional processes by assuming linear gene responses and linear
  dynamics in TFA, or ignore the temporal information in data from such systems.


- Our reconstructed TFA is closer to the experimentally determined profile of
  p53 concentration than that from the original study.
 
 
** Conclusion

* [?] Gabrilian2019 - TB DEPOT (Data Exploration Portal): A multi- domain tuberculosis data analysis resource
** Notes
** FileName
- Gabrielian2019_TbDepotDataAnalysisResource.pdf
** Abstract
** Conclusion
* [X] Garnier2019 - Automatic diagnostics of tuberculosis using convolutional neural networks analysis of MODS digital images
** Notes
** FileName
- Garnier2019_TbImagesDiagnostics.pdf
** Abstract
** Conclusion
* [-] Muzondiwa2020 - Resistance Sniffer: An online tool for prediction of drug resistance patterns of Mycobacterium tuberculosis isolates using next generation sequencing data
** Notes
- In future, this paper could be the foundation of a proper prdiction tool and paper
** FileName
- Muzondiwa2020_ResistanceSniffer.pdf
** Abstract
** Conclusion
