TopicResearch/Mycobacterium/_Resources.html
<div id="outline-container-orgde621f2" class="outline-3">
<h3 id="orgde621f2"><span class="section-number-3">56.3</span> Abstract</h3>
<div class="outline-text-3" id="text-56-3">
<ul class="org-ul">
<li>DosR is an important regulator of the response to stress such as limited
oxygen availability in Mycobacterium tuberculosis</li>

<li>Most of the approaches capture only a first-order approximation to the complex
transcriptional processes by assuming linear gene responses and linear
dynamics in TFA, or ignore the temporal information in data from such systems.</li>
</ul>


<ul class="org-ul">
<li>Our reconstructed TFA is closer to the experimentally determined profile of
p53 concentration than that from the original study.</li>
</ul>
</div>
</div>


<div id="outline-container-org22e7dc7" class="outline-3">
<h3 id="org22e7dc7"><span class="section-number-3">56.4</span> Conclusion</h3>
</div>
</div>

<div id="outline-container-org174cdbc" class="outline-2">
<h2 id="org174cdbc"><span class="section-number-2">57</span> <span class="todo ___">[?]</span> Gabrilian2019 - TB DEPOT (Data Exploration Portal): A multi- domain tuberculosis data analysis resource</h2>
<div class="outline-text-2" id="text-57">
</div>
<div id="outline-container-orgbe83ed9" class="outline-3">
<h3 id="orgbe83ed9"><span class="section-number-3">57.1</span> Notes</h3>
</div>
<div id="outline-container-org93b29fa" class="outline-3">
<h3 id="org93b29fa"><span class="section-number-3">57.2</span> FileName</h3>
<div class="outline-text-3" id="text-57-2">
<ul class="org-ul">
<li>Gabrielian2019<sub>TbDepotDataAnalysisResource.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-orge791a09" class="outline-3">
<h3 id="orge791a09"><span class="section-number-3">57.3</span> Abstract</h3>
</div>
<div id="outline-container-org61252e0" class="outline-3">
<h3 id="org61252e0"><span class="section-number-3">57.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-org5e0241d" class="outline-2">
<h2 id="org5e0241d"><span class="section-number-2">58</span> <span class="done _X_">[X]</span> Garnier2019 - Automatic diagnostics of tuberculosis using convolutional neural networks analysis of MODS digital images</h2>
<div class="outline-text-2" id="text-58">
</div>
<div id="outline-container-org5003aad" class="outline-3">
<h3 id="org5003aad"><span class="section-number-3">58.1</span> Notes</h3>
</div>
<div id="outline-container-org6ceb1d6" class="outline-3">
<h3 id="org6ceb1d6"><span class="section-number-3">58.2</span> FileName</h3>
<div class="outline-text-3" id="text-58-2">
<ul class="org-ul">
<li>Garnier2019<sub>TbImagesDiagnostics.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org7aedc2a" class="outline-3">
<h3 id="org7aedc2a"><span class="section-number-3">58.3</span> Abstract</h3>
</div>
<div id="outline-container-org50f88c8" class="outline-3">
<h3 id="org50f88c8"><span class="section-number-3">58.4</span> Conclusion</h3>
</div>
</div>
<div id="outline-container-org7ace1ea" class="outline-2">
<h2 id="org7ace1ea"><span class="section-number-2">59</span> <span class="todo ___">[-]</span> Muzondiwa2020 - Resistance Sniffer: An online tool for prediction of drug resistance patterns of Mycobacterium tuberculosis isolates using next generation sequencing data</h2>
<div class="outline-text-2" id="text-59">
</div>
<div id="outline-container-org0858bb1" class="outline-3">
<h3 id="org0858bb1"><span class="section-number-3">59.1</span> Notes</h3>
<div class="outline-text-3" id="text-59-1">
<ul class="org-ul">
<li>In future, this paper could be the foundation of a proper prdiction tool and paper</li>
</ul>
</div>
</div>
<div id="outline-container-orgc9e78f0" class="outline-3">
<h3 id="orgc9e78f0"><span class="section-number-3">59.2</span> FileName</h3>
<div class="outline-text-3" id="text-59-2">
<ul class="org-ul">
<li>Muzondiwa2020<sub>ResistanceSniffer.pdf</sub></li>
</ul>
</div>
</div>
<div id="outline-container-org62bef29" class="outline-3">
<h3 id="org62bef29"><span class="section-number-3">59.3</span> Abstract</h3>
</div>
<div id="outline-container-org1284d92" class="outline-3">
<h3 id="org1284d92"><span class="section-number-3">59.4</span> Conclusion</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abhinav Sharma</p>
<p class="date">Created: 2020-05-10 Sun 01:10</p>
</div>
</body>
</html>
